[
  {
    "category": "business",
    "title": "When Lawyers Switch Sides on Their Own Client: The $15 Million Lesson of Bancrédito",
    "shortdescription": "Bancrédito, a small Puerto Rican bank, faced a $15 million penalty for willfully failing to report suspicious transactions despite earlier legal assurances. This case highlights the costly consequences of compliance failures and legal misadvice.",
    "description": "Bancrédito International Bank & Trust was a small Puerto Rican bank with a special offshore license. Like all banks, it had to follow the Bank Secrecy Act (BSA) and anti-money-laundering (AML) rules: laws designed to catch shady transactions and make sure suspicious activity reports (SARs) are filed when money looks questionable. In 2020, Bancrédito’s lawyers—respected firms from San Juan and Miami—told regulators in writing that the bank’s compliance program was “adequate” and risk-based. They even stressed that filing SARs is a matter of judgment, not guesswork. In other words: the bank was doing  what the law required. Those lawyers helped negotiate a settlement with Puerto Rico’s banking watchdog, which ended with a slap on the wrist: a $97,000 fine and a plan for improvements. For a bank, that’s like paying a speeding ticket—not pleasant, but survivable",
    "author": "Daniel C. Smith",
    "creator": "@Da_niel_Smith",
    "twitter": "https://x.com/Da_niel_Smith",
    "image": "/images/bancredito-15-million-lawyers-switch.webp",
    "slug": "lawyers-switch-sides-bancredito-15-million-lesson",
    "date": "17th Sept 2025"
  },
  {
    "category": "business",
    "title": "Asian shares trade in a narrow range as traders brace for a possible US government shutdown",
    "shortdescription": "Asian markets were flat on U.S. shutdown risks and weak China data. Wall Street rose on tech rebound, gold hit a record, oil fell.",
    "description": "Asian shares were little changed in narrow trading Tuesday as investors braced for a possible U.S. government shutdown. Japan’s benchmark Nikkei 225 inched down less than 0.1% in morning trading to 45,023.48. China reported lackluster data on factory activity for September that reflect persistent weakness in the world’s second largest economy as trade tensions with the U.S. weigh on exports. Hong Kong’s Hang Seng was virtually unchanged, rising less than 0.1% to 26,624.16. The Shanghai Composite index added 0.4% to 3,878.88. Elsewhere in Asia, Australia’s S&P/ASX 200 edged up 0.1% to 8,872.40. South Korea’s Kospi gained nearly 0.2% to 3,436.25. The U.S. federal government is nearing a budget deadline that could result in its shutdown. Past shutdowns have had minimal impact on markets and the economy. But if the stalemate between Democratic and Republican lawmakers persists, that could delay the collection and release of economic data, such as on jobs and inflation. This shutdown may also be different because the White House may push for large-scale firings of federal workers. It feels as though the market has already flogged the government shutdown story from every conceivable angle, the way traders circle a fading theme until there’s nothing left but dust. Yet with the clock ticking down to less than 24 hours before the doors are slated to close in Washington, the narrative refuses to die, said Stephen Innes. managing partner at SPI Asset Management.On Monday, Wall Street finished higher as technology stocks recovered some of their losses from late last week.The S&P 500 added 0.3% to 6,661.21 and the Dow Jones Industrial Average edged 0.1% higher, to 46,316.07. The Nasdaq composite climbed 0.5% to 22,591.15. Big Tech stocks ticked higher. Amazon added 1.1% following its 5.1% drop last week, and Microsoft rose 0.6% to recover some of its 1.2% decline. They were two of the strongest forces lifting the S&P 500 because they’re two of Wall Street’s most valuable stocks. A report is due Friday about how many jobs U.S. employers created and cut last month. The hope is that it will be balanced enough to keep the Federal Reserve on track to continue cutting interest rates. The Fed just delivered its first cut of the year, and officials have penciled in more through the end of next year. That’s critical for investors because U.S. stocks have shot to records from a low in April in large part because of expectations for several cuts from the Fed. Easier rates can give the job market a boost and make investors more willing to pay high prices for stocks and other investments. If Friday’s job numbers prove too strong, they could make the Fed less willing to cut rates. That could hurt stocks, which already face criticism that they’ve become too expensive following their big rally. If the job numbers are too weak, they could mean a recession that would hurt stock prices on its own. Electronic Arts climbed 4.5% after the video game maker confirmed rumors of a $55 billion buyout. A group of investors will pay $210 in cash for each share of EA, and they are calling it history’s largest all-cash deal to take a business private.Gold topped $3,850 per ounce to continue its record-breaking run amid expectations for cuts to interest rates by the Fed, along with worries about inflation and the mountains of debt that governments are carrying worldwide. In other dealings early Tuesday, benchmark U.S. crude fell 45 cents to $63.00 a barrel. Brent crude, the international standard, lost 51 cents to $66.58 a barrel. The U.S. dollar fell to 148.54 Japanese yen from 148.60 yen. The euro cost $1.1725, down from $1.1727.",
    "author": "Thomas A. Brennan",
    "creator": "@Thomas_abrennan",
    "twitter": "https://x.com/Thomas_abrennan",
    "image": "/images/asian-markets-us-shutdown-fed-gold-oil.webp",
    "slug": "asian-markets-us-shutdown-fed-rate-cuts-gold",
    "date": "Sept. 30, 2025"
  },
  {
    "category": "business",
    "title": "China’s factory activity contracts for a 6th straight month as trade tensions weigh on the economy",
    "shortdescription": "China’s factory activity contracted for a sixth month in September, with official PMI at 49.8 but a private survey showing growth. Weak demand, trade tensions, and thin margins persist despite slight output gains.",
    "description": "China’s factory activity shrank for a sixth straight month in September, the longest slump since 2019, an official report said Tuesday. The official manufacturing purchasing managers index, or PMI, improved to 49.8 from 49.4 in August. But it remained below the 50-cutoff level between contraction and expansion on a scale of 0 to 100. A private sector PMI survey by the credit research and rating startup RatingDog was more upbeat, with September’s overall PMI rising to 51.2 from 50.5 in August. The mixed manufacturing measures reflect persisting sluggish domestic demand and uncertainties over trade tensions with the United States. More detailed data measuring new orders and production saw month-on-month improvements. The September PMI reads from China offered a picture that looked less like a coherent growth engine and more like a car with one cylinder firing while another misfires, Stephen Innes of SPI Asset Management said in a commentary. Companies are under pressure from price cutting amid rough competition, he said. Factories are moving more goods, but they’re being forced to do it at thinner margins, like street vendors selling more bowls of noodles at half price just to keep the crowd coming, Innes said. The latest data show China’s economy is gaining momentum, with output accelerating slightly, said National Bureau of Statistics chief statistician Huo Lihui. China’s official manufacturing PMIs first slipped back into contraction in April as trade friction with U.S. President Donald Trump’s administration heated up after he took office. The two sides are still slowly working their way toward a broad trade agreement after exchanging threats of sky-high tariffs on each others’ exports. A pause in steep U.S. tariff hikes on China has been extended until November, while a Sept. 19 phone call between Trump and Chinese leader Xi Jinping offered glimmers of hope for improving relations. A truce hinges largely on a widely anticipated U.S. proposal for transferring ownership of TikTok to a U.S. company from its Chinese owner ByteDance. That would also require Beijing’s approval. A face-to-face meeting between Trump and Xi is set for the end of October in South Korea on the sidelines of an annual summit of the Asia-Pacific Economic Cooperation forum. China’s economy has remained in the doldrums, bogged down by a prolonged slump in the property sector, elevated unemployment and weak household spending. Some economists are hoping that a rate cut by China’s central bank by the end of the year could help encourage more spending and investment. This month, the People’s Bank of China left its key lending rates unchanged following the U.S. Federal Reserve’s rate cut for the first time this year.",
    "author": "Thomas A. Brennan",
    "creator": "@Thomas_abrennan",
    "twitter": "https://x.com/Thomas_abrennan",
    "image": "/images/china-factory-activity-september.webp",
    "slug": "china-factory-activity-september",
    "date": "Sept. 30, 2025"
  },
  {
    "category": "business",
    "title": "Wall Street ticks higher as technology stocks lead the way",
    "shortdescription": "U.S. stocks edged higher as tech rebounded; oil fell on lower crude. Investors await jobs data for Fed clues. EA surged on a $55B buyout, CSX rose on a new CEO, and cannabis stocks jumped after Trump’s CBD comments.",
    "description": "Wall Street ticked higher on Monday as technology stocks recovered some of their losses from late last week. The S&P 500 added 0.3%. The Dow Jones Industrial Average rose 68 points, or 0.1%, and the Nasdaq composite climbed 0.5%. All three are near their all-time highs set a week ago. Big Tech stocks ticked higher to lead the way. Amazon added 1.1% following its 5.1% drop last week, and Microsoft rose 0.6% to recover some of its 1.2% decline. While their moves were modest, they were still two of the strongest forces lifting the S&P 500 Monday because they’re two of Wall Street’s most valuable stocks. On the losing end of the market were companies in the oil business, which were hurt by slumping crude prices. Drops of 2.6% for Exxon Mobil and 2.5% for Chevron were two of the heaviest weights on the S&P 500. This week’s highlight is scheduled to arrive on Friday, when a report will be due about how many jobs U.S. employers created and destroyed last month. The hope is that it will be balanced enough to keep the Federal Reserve on track to continue cutting interest rates. The Fed just delivered its first cut of the year, and officials have penciled in more through the end of next year. That’s critical for investors because U.S. stocks have shot to records from a low in April in large part because of expectations for several cuts from the Fed. Easier rates can give the job market a boost and make investors more willing to pay high prices for stocks and other investments. If Friday’s job numbers prove too strong, they could make the Fed less willing to cut rates. That could hurt stocks, which already face criticism that they’ve become too expensive following their big rally. If the job numbers are too weak, they could mean a recession that would hurt stock prices on its own. One wild card may pop up in the interim: The U.S. government is nearing a deadline that could result in its shutdown. The United States has already had many such shutdowns in the past, which have caused only minimal waves for the U.S. stock market and for the economy. But another shutdown could delay the collection and release of economic data, such as on jobs and inflation. Without those reports, increasing uncertainty on Wall Street could make markets more twitchy. This shutdown may also be different because the White House may push for large-scale firings of federal workers this time around. “We believe that a shutdown will have only a small and transitory economic impact, but it may spur some financial market volatility,” according to Jennifer Timmerman, investment strategy analyst at Wells Fargo Investment Institute. On Wall Street, Electronic Arts climbed 4.5% after the video game maker confirmed rumors of a $55 billion buyout. A group of investors will pay $210 in cash for each share of EA, and they are calling it history’s largest all-cash deal to take a business private. CSX chugged 5.4% higher after the railroad operator named Steve Angel as its chief executive. Angel was previously CEO of Linde and its predecessor Praxair, and he is replacing Joe Hinrichs, who also left CSX’s board. Stocks in the marijuana-related business soared after President Donald Trump posted a video to his social media network calling hemp-derived CBD a “game changer” in improving the quality of life for seniors. Tilray Brands jumped 60.9%, and Canada’s Canopy Growth rose 17% in Toronto. All told, the S&P 500 rose 17.51 points to 6,661.21. The Dow Jones Industrial Average added 68.78 to 46,316.07, and the Nasdaq composite climbed 107.09 to 22,591.15. In stock markets abroad, indexes mostly rose in Europe and Asia. The FTSE 100 in London added 0.2% as GSK climbed 2.2% after the pharmaceutical giant said CEO Emma Walmsley will step down at the end of the year. Luke Miels, currently GSK’s chief commercial officer, will replace the 56-year-old Walmsley, who was the first woman to lead a major pharmaceutical company. The Hang Seng in Hong Kong jumped 1.9%, and Tokyo’s Nikkei 225 fell 0.7% for two of the world’s bigger moves. Oil prices slumped more than 3%. Analysts cited reports that oil-producing nations in the OPEC+ group might raise their production limits next month, which added to the notion that too much supply is washing around the world. Gold topped $3,850 per ounce to continue its record-breaking run amid expectations for cuts to interest rates by the Fed, along with worries about inflation and the mountains of debt that governments are carrying worldwide. In the bond market, the yield on the 10-year Treasury eased to 4.14% from 4.20% late Friday.",
    "image": "/images/wall-street-tech-rebound.webp",
    "author": "Thomas A. Brennan",
    "creator": "@Thomas_abrennan",
    "twitter": "https://x.com/Thomas_abrennan",
    "slug": "wall-street-rises-tech-rebound-fed-rate-cut-hopes",
    "date": "Oct. 07, 2025"
  },
  {
    "category": "business",
    "title": "The US stock market keeps setting records as AI excitement keeps building",
    "shortdescription": "Wall Street hit new records as AI enthusiasm drove gains, led by AMD’s surge after an OpenAI deal, while Nvidia dipped slightly. Global markets moved on political changes in Japan and France.",
    "description": "Wall Street keeps setting more records, and excitement about the artificial-intelligence industry keeps leading the way. The S&P 500 climbed 0.4% to set an all-time high following mixed trading on Monday. The Dow Jones Industrial Average dipped 63 points, or 0.1%, while the Nasdaq composite rose 0.7% to its own record. Advanced Micro Devices helped lead the way and soared 23.7% after announcing a deal where OpenAI will use its chips to power AI infrastructure. As part of the deal, OpenAI could own up to 160 million shares of AMD if it hits certain milestones. A frenzy around AI has been one of the main reasons Wall Street has been hitting record after record, though that’s also raising worries that prices have potentially shot too high. Much of the furor around AI in the last couple weeks has come from OpenAI, which has quickly grown into a $500 billion company. It’s been announcing deals with businesses around the world to develop more AI infrastructure. Another chip company, Nvidia, announced a deal last month where it would invest $100 billion in OpenAI as part of a partnership, creating criticism that the AI investment pipeline was beginning to appear like a circle. Nvidia slipped 1.1% following the AMD announcement. Because it’s the most valuable stock on Wall Street, Nvidia was the heaviest weight on the S&P 500. Outside of tech, Comerica jumped 13.7% after Fifth Third Bancorp agreed to buy it in an all-stock deal valued at $10.9 billion. The combination would create the country’s ninth-largest bank. Fifth Third’s stock fell 1.4%. Tesla rose 5.4% after social-media postings by the electric-vehicle maker hinted at a possible product unveiling coming on Tuesday. Verizon Communications fell 5.1% after the telecom replaced its chief executive. Dan Schulman, a director at the company and former CEO of PayPal, is taking over for Hans Vestburg. Elsewhere on Wall Street, trading was relatively quiet as the stock market continues to largely ignore the U.S. government’s shutdown. Past closures of the federal government have had minimal effect on the stock market or on the economy, and the bet on Wall Street is that something similar will happen again.All told, the S&P 500 rose 24.49 points to 6,740.28. The Dow Jones Industrial Average fell 63.31 to 46,694.97, and the Nasdaq composite rose 161.16 to 22,941.67. Politics are playing a bigger role in stock markets abroad, as Japanese stocks soared and French stocks slumped following their latest political shake-ups. Japan’s Nikkei 225 jumped 4.8% after the country’s Liberal Democratic Party chose Sanae Takaichi as its leader. She was an ally of the late Prime Minister Shinzo Abe, who pushed for lower interest rates and other policies that investors liked. The yen’s value dropped against the U.S. dollar on expectations that Takaichi will boost spending, likely adding to inflationary pressures. That in turn helped push up stocks of Japanese exporters, whose products can become more attractive on the global market when the yen is cheaper. “Obviously, investors like what she has been saying and certainly today judging by the number of stocks that moved and which stocks moved, it seems like pretty much led by foreigners so far,” Neil Newman, head of strategy at Astris Advisory Japan, said about Takaichi. In Paris, the CAC 40 index slumped 1.4% following the resignation of France’s new prime minister. Sébastien Lecornu resigned a day after he named his government, drawing a backlash across the political spectrum for his choice of ministers. French politics have been in disarray since President Emmanuel Macron called snap elections last year that produced a deeply fragmented legislature. In the bond market, the yield on the 10-year Treasury rose to 4.16% from 4.13% late Friday. The shutdown of the U.S. government likely means delays for U.S. economic reports scheduled for this week, though investors will have some earnings reports to comb through, including from Delta Air Lines, PepsiCo and Levi Strauss. Despite the shutdown, the Federal Reserve will release minutes from its meeting last month, when it cut its benchmark interest rate for the first time this year. Much on Wall Street is riding on expectations that the Fed will continue cutting interest rates through this year and into next.",
    "image": "/images/wall-street-ai-market-records.webp",
    "author": "Thomas A. Brennan",
    "creator": "@Thomas_abrennan",
    "twitter": "https://x.com/Thomas_abrennan",
    "slug": "wall-street-hits-records-as-ai-boom-drives-market-gains",
    "date": "Oct. 07, 2025"
  },
  {
    "category": "business",
    "title": "DC’s shutdown hasn’t stopped the stock market. Here’s what may",
    "shortdescription": "Wall Street hits record highs despite the U.S. shutdown, driven by AI optimism and expected Fed rate cuts, though high valuations raise caution.",
    "description": "NEW YORK (AP) — If the U.S. government’s latest shutdown can’t stop the stock market, what can? Stock prices keep rising, even as the shutdown delays important economic reports that usually steer trading. The S&P 500 and Dow Jones Industrial Average set all-time highs Friday. It’s not just Big Tech driving the market, which has often been the case in recent years. Sure, Nvidia and other darlings of the artificial-intelligence frenzy are still climbing, but almost everything on Wall Street is coming up a winner. The Russell 2000 index of smaller stocks has set a record after taking nearly four years to get back to its prior all-time high. Gold also hit a record in an unusual confluence, while the most popular U.S. bond fund is on track for its best year in at least five. Past shutdowns have had minimal effect on the stock market or on the economy, and the bet on Wall Street is that something similar will happen again. Many professional investors expect the market to climb still more, even after a 35% surge from its low in April. That’s not to say there aren’t risks. Much of the optimism is built on expectations for certain things to happen. If they don’t, the pretty picture on Wall Street could become much uglier. Among the potential concerns: Stocks are expensive This is the easiest criticism to make about the stock market following its nearly relentless rally since April. Stock prices tend to follow the path of corporate profits over the long term, but stock prices have surged much faster than profits lately. One measure popularized by Nobel-winning economist Robert Shiller, which looks at profits over the preceding 10 years, shows the S&P 500 near its most expensive level since the 2000 dot-com bubble. Some critics have made parallels between that bubble, which saw the S&P 500 eventually halve in value, and the recent AI bonanza. It’s not just the big household names in the S&P 500 index raising concern. Ann Miletti, head of equity investments for Allspring Global Investments, has been struck by how much stock prices have shot up for speculative kinds of stocks, such as smaller, money-losing companies. They’ve done much better than their profitable counterparts in recent months. She said she’s feeling relatively optimistic about conditions for stocks going into 2026, but “it’s these little bubbles that are concerning to me. When you see things like this, it’s generally not a good thing.” To be sure, signals suggesting a too-expensive stock market are famously bad at predicting turning points in the market. Stocks can stay expensive for a while, as long as investors stay willing to pay the high prices. For stocks to look more typical in valuation, either stock prices need to drop, or corporate profits need to rise. That’s raising stakes for the upcoming profit reporting season. Companies are lining up to tell investors how much profit they made during the summer, with PepsiCo and Delta Air Lines scheduled to lead off on Thursday. JPMorgan Chase and other big banks will follow quickly afterward. Analysts are looking for S&P 500 companies to report collective growth of 8% in earnings per share from a year earlier, according to FactSet. They’ll need not only to hit that target, but also to forecast continued growth for the rest of this year into next. That’s even though companies are still trying to figure out how to deal with tariffs, stubbornly high inflation and other shifts in an uncertain economy. One of the main reasons the stock market has boomed is the expectation that the Fed will deliver a string of cuts to interest rates. Lower rates give the economy a boost by making it cheaper for U.S. households and companies to borrow and spend. They can also make investors willing to pay higher prices for stocks, bonds and other investments. Traders on Wall Street are largely expecting the Fed to cut interest rates at least three more times by the middle of next summer, according to data from CME Group. Fed officials themselves have indicated they’re likely to cut because the job market is slowing. But Chair Jerome Powell has insisted they may have to change plans quickly. That’s because inflation has remained stubbornly above the Fed’s 2% target, and lower interest rates can give inflation more fuel. “I feel like interest rates and expectations of what the Fed is going to do are driving everything right now,” Miletti said. “If the Fed doesn’t cut as much as people are expecting, any of these areas that look a little speculative, because they’re not based on fundamentals, those areas will have some real problems.” “This is the question of the decade,” said Yung-Yu Ma, chief investment strategist at PNC Asset Management Group. Ma does not feel that AI-related stocks look too expensive, even after their big climbs, but that’s only as long as gangbusters growth and sales for the industry keep going. Hopes for AI also seem to be helping to keep down longer-term interest rates and worries about inflation. AI will need to make the economy more productive in order to offset the upward pressure on inflation and interest rates that are coming from the huge mountains of debt that the U.S. and other governments worldwide are building. “If we do achieve these benefits for companies and for people’s lives, everything can go well for years,” said Ma. “I think everyone is tying their fortunes to that ship, whether they realize it or not.”",
    "image": "/images/wall-street-ai-shutdown-rally.webp",
    "author": "Thomas A. Brennan",
    "creator": "@Thomas_abrennan",
    "twitter": "https://x.com/Thomas_abrennan",
    "slug": "wall-street-surges-despite-us-shutdown-and-ai-market-risks",
    "date": "Oct. 07, 2025"
  },
  {
    "category": "business",
    "title": "Lack of jobs data due to government shutdown muddies view of hiring and the US economy",
    "shortdescription": "The U.S. government shutdown delayed September’s jobs report, showing weak hiring but low unemployment, with economists tracking alternative data amid uncertainty.",
    "description": "From Wall Street trading floors to the Federal Reserve to economists sipping coffee in their home offices, the first Friday morning of the month typically brings a quiet hush around 8:30 a.m. eastern as everyone awaits the Labor Department’s crucial monthly jobs report. But with the government shut down, no information was released Friday about hiring in September. The interruption in the data has occurred at a particularly uncertain time, when policymakers at the Federal Reserve and Wall Street investors would need more data on the economy, rather than less. Hiring has ground nearly to a halt, threatening to drag down the broader economy. Yet at the same time, consumers — particularly higher-income earners — are still spending and some businesses are ramping up investments in data centers developing artificial intelligence models. Whether that is enough to revive hiring remains to be seen. It’s the first time since a government shutdown in 2013 that the jobs report has been delayed. During the 2018-2019 partial government closure, the Labor Department was one of several agencies that remained open because Congress had agreed to fund them. September’s jobs figures will be released eventually, once the shutdown ends. If the shutdown continues for another week or more, it could also postpone the release of other high-profile data, including the next inflation report, set for Oct. 15. The Trump administration has blamed Senate Democrats for the shutdown, while Democrats levy similar charges against the White House. “Businesses, families, policymakers, markets, and even the Federal Reserve are flying blind at a key juncture in America’s economic resurgence because the Democrats’ government shutdown has halted the release of key economic data,” said White House spokesman Kush Desai. Yet President Donald Trump himself has often trashed government jobs data when it has painted an unflattering picture of the economy. In August, he fired the then-head of the Bureau of Labor Statistics after the agency reported that job gains in May and June had been sharply lower than previously reported. For now, economists are turning to alternative measures of the job market provided by nonprofits and private-sector companies. Those measures mostly show a job market with little hiring, but not many layoffs, either. Those who have jobs appear to be mostly secure, while those looking for work are having a tougher time. Payroll processor ADP, for example, said Wednesday that its estimate showed the economy had lost a surprising 32,000 private-sector jobs last month. Companies in the construction, manufacturing, and financial services industries all cut jobs, ADP found. Restaurants and hotels, and professional services such as accounting and engineering, also shed workers. Businesses in health care, private education, and information technology were the only sectors to add workers, ADP said. “We’ve seen a significant decline in hiring momentum throughout the year,” said Nela Richardson, ADP’s chief economist. “This is consistent with a low hire -- even a no-hire — and low fire economy.” Austan Goolsbee, before becoming president of the Federal Reserve Bank of Chicago in January 2023, was one of those busy economists on the first Friday morning of the month, often dissecting the data for the financial news network CNBC. Now he still checks the data Friday mornings and has a team of research economists that analyze the report. “It’s still the best data -- the BLS numbers are the best labor market numbers in the world,” Goolsbee said in an interview with The Associated Press. “And when we don’t have them, we suffer.” Just last month, however, the Chicago Fed began issuing its own estimates of the unemployment rate and other job-market indicators, using a combination of public and private-sector data, which it updates every two weeks. On Thursday, its latest figures put the unemployment rate in September at 4.3%, the same as in August and still low historically. Goolsbee said the Chicago Fed prefers to focus more on rates, such as the unemployment figure, and layoff and hiring rates, as an indicator of recession risk, because they are less affected by changes in immigration patterns and the aging of the U.S. workforce than the changes in total jobs. Still, while there are alternative measures of hiring and unemployment, there are fewer sources of information on inflation, which the Fed is charged with keeping stable and low. Prices have picked up in recent months for many imported goods, mostly because of tariffs, but Goolsbee said that he is closely watching inflation in services, which have perked up in the past two months. Higher services prices are a potential sign that inflation is spreading beyond just imported products. Goolsbee is eager to see the next inflation report to see if the trend continues. “That makes the government shut down, lack of BLS data that much more concerning,” Goolsbee said. On Friday, the Institute for Supply Management, a trade group of purchasing managers, released its monthly report on economic activity in the services sector, which includes everything from banking to restaurants to retail stores to warehousing and covers about 90% of the economy. Its index dropped to 50, from 52, with 50 the dividing line between shrinking and expanding. That means services sector activity was unchanged last month. But services companies did cut back on hiring for the fourth straight month, the ISM’s survey found, suggesting that job gains remained weak last month.",
    "author": "Thomas A. Brennan",
    "creator": "@Thomas_abrennan",
    "twitter": "https://x.com/Thomas_abrennan",
    "image": "/images/us-jobs-report-shutdown.webp",
    "slug": "us-government-shutdown-delays-jobs-report-hiring-weak",
    "date": "Oct. 07, 2025"
  },
  {
    "category": "business",
    "title": "Stocks wobble as Wall Street wrangles with whether the job market is too weak",
    "shortdescription": "U.S. stocks dipped as weaker-than-expected August jobs data raised hopes for Fed rate cuts, while investors weigh economic growth and AI-driven market gains. Broadcom and Tesla led gains, but Lululemon and Nvidia pulled the market lower.",
    "description": "U.S. stocks wobbled lower on Friday as Wall Street questioned whether the U.S. job market has slowed by just enough to get the Federal Reserve to cut interest rates to help the economy, or by so much that a downturn may be on the way. After rising to an early gain, the S&P 500 erased it and fell 0.3% below the all-time high it set the day before. The Dow Jones Industrial Average dropped 220 points, or 0.5%, after swinging between an early gain of nearly 150 points and a loss of 400. The Nasdaq composite edged down by less than 0.1%. The action was more decisive in the bond market, where Treasury yields tumbled after a report from the Labor Department said U.S. employers hired fewer workers in August than economists expected. The government also said that earlier estimates for June and July overstated hiring by 21,000 jobs. The disappointing numbers follow last month’s discouraging jobs update, along with other lackluster reports in intervening weeks, and traders are now betting on a 100% probability that the Fed will cut its main interest rate at its next meeting on Sept. 17, according to data from CME Group. Investors love such cuts because they can give a kickstart to the economy, but the Fed has held off on them because they can also give inflation more fuel. So far this year, the Fed has been more worried about the potential of inflation worsening because of President Donald Trump’s tariffs than about the job market. But Friday’s job numbers could push the Fed to consider cutting rates in two weeks by a steeper amount than usual, said Brian Jacobsen, chief economist at Annex Wealth Management. “This week has been a story of a slowing labor market, and today’s data was the exclamation point,” according to Ellen Zentner, chief economic strategist for Morgan Stanley Wealth Management. Strong hiring for health care jobs had been helping to support the overall market, “but with it now showing some tangible signs of decline, the foundation underneath the labor market seems to be cracking,” said Rick Rieder, chief investment officer of global fixed income at BlackRock. While the data on the job market is disappointing, it’s still not so weak that it’s screaming a recession is here, and the U.S. economy is continuing to grow. A big question for investors is whether the job market can remain in a balance where it’s not so strong that it prevents cuts to interest rates but also not so weak that the economy falls off. Uncertainty about that helped lead to Friday’s swings in the stock market. Wall Street needs things to go as hoped because it already sent stock prices to records amid expectations for a Goldilocks scenario where interest rates ease, and the economy keeps chugging along. On Wall Street, Friday’s heaviest weight was Nvidia, the chip company that’s become the face of the artificial-intelligence boom. It’s been contending with criticism that its stock price charged too high, too fast and became too expensive following Wall Street’s rush into AI, and it fell 2.7%. Lululemon dropped 18.6% after the yoga and athletic gear maker’s revenue for the latest quarter fell short of analysts’ expectations. CEO Calvin McDonald pointed to disappointing results from its U.S. operation, while Chief Financial Officer Meghan Frank said Lululemon is facing “industrywide challenges, including higher tariff rates.” Still, more stocks rose on Wall Street than fell. Leading the way was Broadcom, which climbed 9.4% after reporting better profit and revenue for the latest quarter than analysts expected. CEO Hock Tan said customers are continuing to invest strongly in AI chips. Tesla rose 3.6% after proposing a payout package that could reach $1 trillion for its CEO, Elon Musk, if the electric vehicle company meets a series of extremely aggressive targets over the next 10 years. Smith & Wesson Brands jumped 6.5% after the gun maker delivered better results for the latest quarter than analysts expected. CEO Mark Smith said it saw good demand for new products in what’s traditionally a slow season for sales of firearms. All told, the S&P 500 fell 20.58 points to 6,481.50. The Dow Jones Industrial Average dipped 220.43 to 45,400.86, and the Nasdaq composite slipped 7.31 to 21,700.39. In stock markets abroad, indexes in Europe lost early gains to turn lower with Wall Street. That followed strength across much of Asia. The Nikkei 225 rallied 1% in Tokyo after data showed accelerating growth in earnings for Japanese workers. Chinese markets rebounded following three days of decline, with indexes rising more than 1% in both Hong Kong and Shanghai. In the bond market, the yield on the 10-year Treasury dropped to 4.09% from 4.17% late Thursday and from 4.28% on Tuesday. That’s a notable move for the bond market and could mean lower interest rates are coming for mortgages and other loans.",
    "image": "/images/us-stocks-jobs-fed.webp",
    "author": "Thomas A. Brennan",
    "creator": "@Thomas_abrennan",
    "twitter": "https://x.com/Thomas_abrennan",
    "slug": "us-stocks-slide-amid-weak-jobs-data-fed-rate-concerns",
    "date": "Sept. 06, 2025"
  },
  {
    "category": "business",
    "title": "Robinhood joins new band of companies calling the S&P 500 their home",
    "shortdescription": "Robinhood Markets will join the S&P 500 after strong gains from cryptocurrency trading, with shares surging over 15% amid record profits and regulatory clarity.",
    "description": "Online broker Robinhood Markets will join the S&P 500 index after riding the popularity of cryptocurrencies to profitability and an all-time high stock price. The company is set to join the benchmark index on Sept. 22, along with mobile technology platform AppLovin and construction company Emcor Group. Robinhood is having one of its best years since going public in 2021 after struggling early on. It closed below its IPO price of $38 on its first day of trading. The stock remained volatile over the next few years, finishing 2023 at $12.74 per share. The stock has tripled in 2025 so far, trading at more than $100 per share. That follows a similar gain in 2024. An increased interest in cryptocurrency amid a friendlier regulatory environment for the digital currency has helped turn around the online broker’s profits. The company lost 61 cents per share in 2023, but sharply reversed course in 2024 for a profit of $1.56 per share. Wall Street expects the company to close out 2025 with $1.64 per share in profit.The company has been benefitting from the government’s hands off approach to cryptocurrency and regulation during President Donald Trump’s tenure. Earlier this year, the Securities and Exchange Commission closed an investigation into the company. The SEC declined to pursue enforcement action over allegations that Robinhood failed to register certain crypto assets on its platform as securities. Robinhood was also at the center of the original “meme stock” craze in 2021 that centered on heavy trading of GameStop and AMC Entertainment. The company had to temporarily restrict trading of those companies amid a dispute between online activist retail investors and institutional investors. Shares of Robinhood surged 15.8%, while AppLovin shares jumped 11.6%.",
    "image": "/images/robinhood-sp500-crypto.webp",
    "author": "Thomas A. Brennan",
    "creator": "@Thomas_abrennan",
    "twitter": "https://x.com/Thomas_abrennan",
    "slug": "robinhood-joins-sp500-amid-crypto-driven-gains",
    "date": "Sept. 09, 2025"
  },
  {
    "category": "business",
    "title": "EU proposes steel industry protections, rattling UK manufacturers",
    "shortdescription": "The EU proposed cutting its tariff-free steel quota nearly in half, imposing higher tariffs on imports from countries like China, India, and the UK, aiming to protect European steelmakers amid global overcapacity. The move raises concerns for the struggling UK steel industry.",
    "description": "The European Union on Tuesday proposed cutting by almost half its tariff-free quota on steel and steel products, effectively adding large tariffs on imports from countries including China, India, Turkey and the United Kingdom, which said the measures would wreck the British steel industry. After reaching a new quota of 18.3 million tons of imports, additional imports will face a 50% tariff. This is double the current 25% rate — a high price akin to U.S. President Donald Trump’s steel measures. Neighboring nations such as Norway, Iceland and Ukraine will be exempt. The proposal attempts to buttress Europe’s traditional steel manufacturers by imposing trade barriers so that Europe’s markets don’t become flooded with imports diverted by high American tariffs imposed earlier this year. Steel importers would be required to clearly declare where the products were melted and poured, and a complex quota system would govern what enters the EU common market. The proposal replaces a current steel safeguard policy aligned with the World Trade Organization that is set to expire in June 2026. “A strong, decarbonized steel sector is vital for the European Union’s competitiveness, economic security and strategic autonomy. Global overcapacity is damaging our industry,” said European Commission President Ursula von der Leyen.The European Parliament and the European Council must now ratify or amend the proposal, which then might require negotiations with the WTO to check how member countries are affected by the measures. The EU exported 77 billion euros ($89.7 billion) and imported 73.1 billion euros ($85.2 billion) worth of steel in 2024, according to the EU’s statistics agency Eurostat. The European Steel Association estimates that growing global steel overcapacity is at around 602 million tonnes, or four times the EU’s total annual steel consumption Judith Kirton-Darling, general secretary for the trade union bloc IndustriAll’s Europe office, said in September during the Emergency Steel Social that, “steel is the backbone of Europe’s economy, yet the sector is now at breaking point. That is why trade unionists from every corner of Europe have joined steelmakers at this summit to call for urgent action.” Stéphane Séjourné, the European Commission’s executive vice president for industrial strategy, said the proposal would protect Europe’s industrial future. “This is the new safeguard clause on steel. This is the reindustrialization of Europe,” he said in a post on X.Trade body UK Steel said the proposed drop in the tariff-free quota would spell disaster for the embattled British steel industry. It said more than three-quarters of British steel exports go to the EU. “This is perhaps the biggest crisis the U.K. steel industry has ever faced,” said UK Steel Director-General Gareth Stace. He said the British government “must go all out to leverage our trading relationship with the European Union to secure U.K. country quotas or potentially face disaster.” Stace said the EU move also risked “redirecting millions of tonnes of steel towards the U.K.” from countries hit by the tariffs, which “could be terminal for many of our remaining steel companies.” Prime Minister Keir Starmer said the U.K. is “in discussions with the EU” about the proposal. “I’ll be able to tell you more in due course but we are in discussions, as you’d expect,” he said. Britain’s once-mighty steel industry has shrunk dramatically from its 1970s peak and now accounts for 0.1% of the economy. Thousands of jobs are due to be lost at the country’s biggest steelworks, at Port Talbot in Wales, as owner Tata Steel tries to make the unprofitable plant leaner and greener. Community, a trade union that represents many steelworkers, said the EU’s proposal was “an existential threat to our steel industry.” “Global overcapacity is a shared challenge and it is in both the UK and the EU’s interests to work together to find a solution,” said the union’s Assistant General Secretary Alasdair McDiarmid. “A trade war, at what is already a turbulent time for the global steel industry, would be incredibly damaging for everyone involved, with workers in the U.K. and Europe paying the heaviest price.”Steel manufacturers employ about 300,000 people across 20 of the bloc’s 27 nations. But it has been hard-hit over the past two decades, losing perhaps a quarter of its employees, according to Eurostat. Steel is a foundational industry in the EU. The bloc evolved out of the 1951 European Steel and Coal Community, a common market between Luxembourg, Italy, France, the Netherlands, West Germany and Belgium. The United States and the EU have a tenuous trade agreement that has yet to include specific measures for products like whisky, wine and steel. But American and European negotiators have said that they are working on a “ring-fencing” or coordinating steel tariffs to secure supply chains between the two economic juggernauts. EU trade representative Maroš Šefčovič said the steel tariffs and quotas would be discussed on Friday in South Africa during a meeting of trade ministers from the Group of 20 countries. — Lawless reported from London.",
    "image": "/images/eu-steel-tariffs-quota.webp",
    "author": "Thomas A. Brennan",
    "creator": "@Thomas_abrennan",
    "twitter": "https://x.com/Thomas_abrennan",
    "slug": "eu-cuts-steel-quota-raises-tariffs-uk-china-india",
    "date": "Oct. 07, 2025"
  },
  {
    "category": "business",
    "title": "WTO says AI-related buying binge and a spike in US imports spur unexpected rise in goods trade",
    "shortdescription": "The WTO raised its 2025 forecast for goods trade growth to 2.4%, driven by AI-related products, front-loaded U.S. imports, and strong developing-world trade, though 2026 growth is expected to slow.",
    "description": "The World Trade Organization is sharply raising its forecast for trade growth in goods this year after an unexpectedly strong first half due to rising AI-related purchases, front-loaded imports in the U.S. over tariff fears and robust developing-world trade. The Geneva-based trade body said Tuesday its economists are increasing their prediction of growth in merchandise trade to 2.4% this year, up from 0.9% as recently as August. In April, WTO experts were actually anticipating a decline of goods trade this year of 0.2%. However, they’re lowering the prediction for 2026 to 0.5%, from 1.8%. The growth of export in services, meanwhile, is expected to come in at 4.6% in 2025 and 4.4% next year — both slower rates than the 6.8% tallied in 2024. WTO pointed to “robust trade in artificial intelligence-related goods” that are driving the increase in merchandise trade, notably semiconductors, servers and telecommunications equipment.Director-General Ngozi Okonjo-Iweala suggested solid trade growth among developing countries and a cool-headed reaction to sweeping — and often-varying — tariffs announced by the Trump administration earlier this year had underpinned the gains. “Countries’ measured response to tariff changes in general, the growth potential of AI, as well as increased trade among the rest of the world — particularly among emerging economies — helped ease trade setbacks in 2025,” she said. Despite “strong headwinds,” Okonjo-Iweala said trade has shown resilience because of “importers front-loading orders to get ahead of future tariff hikes or retaliation.” U.S. inventories are at record levels by dollar value, and the value of North America’s imports surged 13.2% at an annual rate, driven by pharmaceuticals and precious metals — mostly gold. She also attributed the gains to “soaring demand” for AI-related products behind a capital investment boom. A staggering 42% of global trade growth came from AI-related goods, she said, much higher than their 15% share in world trade. South-South trade — among developing countries — grew 8% year-on-year in value terms in the first half of the year, while such trade involving partners other than China is growing at around 9%, WTO said.",
    "author": "Thomas A. Brennan",
    "creator": "@Thomas_abrennan",
    "twitter": "https://x.com/Thomas_abrennan",
    "image": "/images/wto-trade-growth-ai.webp",
    "slug": "wto-raises-2025-trade-growth-forecast-ai-demand",
    "date": "Oct. 07, 2025"
  },
  {
    "category": "business",
    "title": "Canada’s last hockey stick factory survives in face of tariff threats and globalization ",
    "shortdescription": "Canada’s last major wooden hockey stick factory, Roustan Hockey, faces trade and tariff challenges while producing a shrinking market share, preserving both artisanal manufacturing and a national sports legacy.",
    "description": "Wearing protective gloves and earplugs, a worker feeds lengths of wood into a machine that makes an earsplitting whine as it automatically cuts a groove into the end of each piece. Nearby, stacks of wooden wedges wait to be slotted into those grooves to form the beginnings of a hockey stick. Further down the Roustan Hockey production line, other workers are busy shaping, trimming, sanding, painting and screen printing as they turn lumber into a Canadian national symbol. It’s a typical day on the job for the 15 workers at Canada’s last major hockey stick factory, 60 miles (100 kilometers) southwest of Toronto. The operation has origins that date back to the 1800s and has survived decades of trade globalization to hang on as the last North American commercial manufacturer of traditional wooden hockey sticks. Now it’s facing fresh headwinds from the trade war launched by U.S. President Donald Trump, who has ripped up free trade deals in North America and imposed tariffs on Canadian exports. The uncertainty is making life a headache for Roustan. “You never know” what Trump will do, said Bo Crawford, the factory’s general manager. “You just have to roll with it and the president of the U.S. can change his mind day to day, week to week, hour to hour. So yeah, we have to deal with it the best we can,” he said.Roustan has spent months dealing with U.S. customer worries and navigating the trade challenges. Trump has repeatedly threatened to impose tariffs on Canadian imports, though many goods have ultimately remained exempted because they’re already covered by the U.S.-Mexico-Canada Agreement negotiated during his first term. Then, in late August, the Trump administration eliminated a widely used customs exemption for international shipments worth $800 that resulted in new uncertainty over cross-border trade, said owner and CEO Graeme Roustan. Even if somebody buys one or two or five or 10 sticks and it’s under $100, they’re going to be affected by the tariffs, so the jury is still out on how that’s going to impact business,” Roustan said. Roustan Hockey’s factory churns out about 400,000 wooden hockey sticks a year under the Christian, Northland and Sherwood brands, with about 100,000 exported to the United States. It also makes plastic-bladed road hockey sticks and foam-core goalie sticks. Crawford said shipments to the U.S. have been held up for manual inspections at the border, where they’ve been hit with surprise tariffs, which the company’s customs broker has managed to get waived. It’s not just sticks. Shipments of goalie pads, which Roustan manufactures at a separate factory in Toronto, were recently flagged for an unexpected 200% tariff, which company managers said they’re trying to resolve with new forms from their shipping company. The disruption underscores the broader trade turmoil that’s left the Canadian economy reeling. Canada’s economy shrank 1.6% in the second quarter, in the first contraction since 2023 and the biggest decline since the COVID-19 pandemic. Exports slumped 7.5%, as uncertainty over tariffs and trade pummeled exports to the country’s biggest trading partner, the United States. Those figures overshadow the longer-term decline of Canadian manufacturing. Some 37,800 manufacturing jobs were lost in the year to August, according to official data. Real investment in industrial machinery and equipment fell in the second quarter to the lowest level since records began in 1981, experts at the National Bank of Canada pointed out in a recent research note. “How did we get here? Years of excessive regulation, and a chronic lack of ambition by successive governments in promoting domestic transformation of our natural resources—recently made worse by Washington’s protectionist agenda,” wrote economists Stéfane Marion and Matthieu Arseneau. “That failure has eroded Canada’s manufacturing base and left us at risk of becoming irrelevant in global supply chains.” The Roustan operation started life in 1847 as an agricultural workshop, 20 years before Canada became a country and 70 years before the National Hockey League was created. It’s all that survives of the golden era of North American wooden hockey stick manufacturing in the 1970s and ’80s when there were numerous workshops in Ontario and Quebec, as well as U.S. production centered in Minnesota. Roustan, a businessman who also owns The Hockey News and once attempted to buy the Montreal Canadiens, acquired the operation in 2019 — by then named Heritage Wood Specialties — and moved it from aging facilities in the town of Hespeler, 20 miles (30 kilometers) north of Brantford, hometown of hockey legend Wayne Gretzky. Nowadays, global production amounts to about 5 million hockey sticks a year, but wood makes up only about a tenth. No NHL player has regularly used a wooden stick in well over a decade, underlining the sport’s embrace of newer technology. Composite sticks, made of carbon fiber and other lightweight advanced materials, are now far more popular and preferred by both amateurs and professionals. But composite sticks are pricier because of the advanced manufacturing processes involved. Meanwhile, over the years, Canadian and U.S. production consolidated or moved to Asia and Mexico amid a wider global shift by Western consumer brands in search of cheaper manufacturing overseas. “It’s very hard to compete against some of the Asian markets and some of our competitors that are in other countries,” said Crawford. “But our quality kind of stands for itself.” Roustan acknowledges that the wooden hockey stick market is not a growth industry and, at best, production will hold steady. “Right now, we have, you know, 5-10% of the market. But it’s diminishing every year. And the kids that are growing up today, they are all about composite. So yes, it’s a shrinking market for sure.” At Roustan’s 130,000 square foot factory, the manufacturing process is low-tech and artisanal. At one workstation, a worker uses liquid epoxy to glue fiberglass reinforcing sheets to wooden blades, in batches of six. Nearby, another worker uses a band saw to trim dried excess fiberglass off each blade. In the paint room, sticks are dipped in white paint and then hung on a line of moving hooks to dry. The factory’s story is not just about evolving trade patterns and modern industrial practices, but also about the place that the national winter sport has in the Canadian soul, Roustan said. “It’s important to any country to have a manufacturing base of products that you consume on a regular basis,” said Roustan. “Having a factory that makes hockey sticks in Canada really serves two purposes. One, it contributes to the manufacturing base. But two, (it) has the legacy and the tug of the heartstrings of the game that we all love in Canada.”",
    "author": "Daniel C. Smith",
    "creator": "@Da_niel_Smith",
    "twitter": "https://x.com/Da_niel_Smith",
    "image": "/images/roustan-hockey-factory.webp",
    "slug": "canadas-last-wooden-hockey-stick-factory-trade-challenges",
    "date": "Oct. 06, 2025"
  },
  {
    "category": "business",
    "title": "Japan’s lead trade negotiator defends tariffs deal with the US",
    "shortdescription": "Japan defended its U.S. tariff deal, setting most exports at 15% and committing $550 billion to U.S. projects, despite initial tensions and criticism at home.",
    "description": "Japan’s chief trade negotiator has defended a tariffs deal with the U.S., expressing respect for President Donald Trump and calling him a “tough negotiator. Trade envoy Ryosei Akazawa noted that the pact setting on most Japanese exports to the U.S. at 15% was comparable to a deal between Washington and the European Union. Unlike the EU, Japan did not have to lower its tariffs on U.S. goods, he noted. Japan has also committed to investing $550 billion in U.S. projects. Trump initially set Japan’s tariff rate to increase by 25%. Critics in Japan had ridiculed Akazawa’s repeated trips to the U.S. to work toward a deal as a waste of taxpayer money, saying he should pitch a tent on the White House lawn. Akazawa said talks with his counterpart, U.S. Commerce Secretary Howard Lutnick, Trump and others in his administration were tense at first. By the time of his eighth trip, a rapport was established enabling the two sides to set an agreement by July. “President Trump was a tough negotiator, but I kept insisting, and he would listen graciously. I have all the respect for him,” he told reporters at the Foreign Correspondents’ Club of Japan. “It was a good round of negotiations.” “It goes without saying that, with any government negotiations, there will always be someone who says Japan lost out, no matter what,” Akazawa said. The double-digit tariffs Trump has imposed on imports from various nations were a bitter blow to Japan, a key U.S. ally in Asia. Tokyo especially objected to 25% tariffs Trump ordered for imports of steel and aluminum and automobiles. Japan’s economy depends heavily on exports. Shipments to the United States sank nearly 14% in August compared to a year earlier, the fifth straight month of declines, as auto exports were dented by the tariffs. U.S. tariffs on Japanese automobiles and auto parts are now set at 15%, way higher than the original 2.5%. Japanese automakers also produce many of the vehicles they sell in the U.S. in North America. The friction with the U.S. over tariffs was an added burden for Prime Minister Shigeru Ishiba’s administration. He is due to be replaced as leader of the ruling Liberal Democratic Party later this week. The Liberal Democrats have ruled Japan almost continuously since the 1950s but they have lost their majority in the lower house, which chooses the prime minister, and will need coalition partners. Akazawa brushed off concerns the U.S. understanding of the deal may differ from Japan’s. He said whoever becomes a next prime minister, Japan has an established tradition of respecting agreements, especially those forged with a foreign country.",
    "author": "Daniel C. Smith",
    "creator": "@Da_niel_Smith",
    "twitter": "https://x.com/Da_niel_Smith",
    "image": "/images/japan-us-tariff-deal.webp",
    "slug": "japan-defends-us-tariff-deal-trump-negotiations",
    "date": "Oct. 01, 2025"
  },
  {
    "category": "business",
    "title": "Japan’s central bank survey shows an improved outlook for manufacturers",
    "shortdescription": "Japan’s manufacturers showed improved sentiment in the latest Bank of Japan survey, boosting prospects for a central bank rate hike despite ongoing tariff pressures.",
    "description": "Sentiment among Japan’s large manufacturers improved for a second straight quarter, according to a closely watched Bank of Japan survey, making a rate hike by its central bank more likely. The quarterly survey, called the “tankan,” showed the outlook among major manufacturers, the key so-called diffusion index, rose 1 point to plus 14 from the findings in June. The survey is an indicator of companies foreseeing good conditions minus those feeling pessimistic.The tankan for large manufacturers was plus 12 in March, marking the first drop in a year. Sentiment among large non-manufacturers was unchanged at plus 34, according to the latest tankan.The relative optimism in the latest tankan reflects some relief over an agreement on tariffs with the U.S., reached in July. The deal with the administration of President Donald Trump imposes a 15% tariff on most goods exported to the U.S. Some goods face higher tariffs. Initially, the U.S. imposed a 25% tariff on auto imports, so the latest deal is an improvement for Japanese automakers. It also increases certainty over U.S. policy, at least for now. However the higher tariffs imposed on exports to the world’s biggest market are still squeezing profits, wages, investment and spending for many industries. Kei Fujimoto, senior economist at SuMi Trust, said that despite the concerns about the tariffs’ impact on Japanese corporate earnings, the damage so far has been relatively limited. Inbound tourism is also helping. “We do not believe inbound-related demand from tourists has peaked. The number of tourists visiting Japan continues to show an upward trend,” he said. The tankan findings could influence an upcoming decision by the Bank of Japan on interest rates. The BOJ has kept rates near zero for years to help stimulate consumer spending and business investment and counter weak demand that led to deflation.But prices have risen above the central bank’s target range of about 2%. The tankan shows the average inflation outlook for one year ahead was unchanged at 2.4%. Analysts expect the Bank of Japan to raise its benchmark rate soon, but it’s unclear if it will do so at the next meeting later this month, or later. The central bank raised its benchmark rate to 0.5% from 0.1% earlier this year.",
    "author": "Daniel C. Smith",
    "creator": "@Da_niel_Smith",
    "twitter": "https://x.com/Da_niel_Smith",
    "image": "/images/japan-manufacturers-boj.webp",
    "slug": "japan-manufacturers-sentiment-boj-rate-hike",
    "date": "Oct. 01, 2025"
  },
  {
    "category": "business",
    "title": "Europe’s top central banker says economy holding up better than expected in face of Trump tariffs",
    "shortdescription": "Europe’s economy is holding up better than expected despite U.S. tariffs, aided by a stronger euro, trade deals, and pro-growth measures, says ECB head Christine Lagarde.",
    "description": "Europe’s economy is holding up better than expected in the face of U.S. President Donald Trump’s new tariffs - in part because the European Union didn’t retaliate with self-defeating tariffs of its own, the head of the European Central Bank said Tuesday. Christine Lagarde said the impact of Trump’s trade war on growth and inflation in the 20 countries that use the euro currency had also been softened by a stronger euro and by conclusion of a trade deal with Trump. The deal capped tariffs at 15% and took away uncertainty that threatened to delay or disrupt business investment. “A year ago, most would have assumed that U.S. tariffs... would trigger a major adverse shock to the euro area economy,” Large said in a speech delivered at a central banking conference in Helsinki, Finland. “Yet some of these assumptions have not been borne out.” There had been little impact on inflation, she said, and effects on growth have been “relatively moderate” due to European governments taking pro-growth measures in response. Lagarde said that as a result the ECB’s interest rate policy was “in a good place” and that accordingly the bank couldn’t commit to any future rate path, whether one of action or inaction.” The bank’s next policy meeting is slated for Oct. 30; the bank left its key rate unchanged at 2% at its last meeting Sept. 11.The European Union’s executive commission prepared a list of goods to hit with retaliatory tariffs, or import taxes, but suspended them once the tariff deal was struck between Trump and Commission President Ursula von der Leyen in July. The reasons for nonretaliation included pressure from business groups not to get into a prolonged cycle of tit-for-tat tariff increases, as well as concerns about jeopardizing US support for Ukraine. As a result, Europe was still getting the imported raw materials and goods that it needs for its economy without hindrance from high tariff cost or bottlenecks that could raise prices. “As a result, we have not yet seen significant supply chain disruption,” Lagarde said. “Global supply chain pressures remain contained, and in the euro area, bottleneck indicators are close to historical averages.” Trump’s policies have been accompanied by a fall in the dollar and a correspondent strengthening of the euro. That makes Europe’s imports cheaper and helps the ECB in its efforts to contain the annual rate of inflation, which was a moderate 2% in August. So far, Trump’s series of import taxes appears to have sown more concerns within the U.S. economy, as hiring has sharply cooled while inflation remains elevated. The cost of the tariffs are generally paid by domestic consumers and businesses, even if the taxes can disrupt the sales of foreign companies. The EU and member governments have taken other measures to strengthen growth, such as free trade deals with the South American Mercosur countries - Argentina, Brazil, Bolivia, Paraguan and Uruguay - and with Mexico. National governments have ramped up defense spending due to the perceived threat from a newly aggressive Russia, while Germany has committed to large-scale investment in roads, rails and bridges after years of underspending. Nonetheless, growth remains mediocre, coming in at only 0.1% in the second quarter over the quarter before. Tariffs and the associated uncertainty will still knock some 0.7% percentage points off through 2025 and 2027.",
    "image": "/images/europe-ecb-lagarde.webp",
    "author": "Daniel C. Smith",
    "creator": "@Da_niel_Smith",
    "twitter": "https://x.com/Da_niel_Smith",
    "slug": "europe-economy-resilient-us-tariffs",
    "date": "Sept. 30, 2025"
  },
  {
    "category": "business",
    "title": "Head of EU parliament trade committee has ‘doubts’ about deal with US, says it could be amended",
    "shortdescription": "The EU’s trade deal with the U.S. faces scrutiny as European Parliament trade committee chief Bernd Lange raises doubts and predicts possible amendments, while the EU pursues other free trade deals with Mexico and Mercosur.",
    "description": "The head of the European Parliament’s trade committee said Wednesday he has “doubts” about aspects of the EU’s trade deal with the Trump administration and predicted the deal could be amended during the legislative approval process. “A lot of questions are there, and I guess there will be some amendments,” said committee chairman Bernd Lange, adding that “myself and also some colleagues of mine have doubts about the deal.” Lange stopped short of outright opposing the agreement struck July 27 between the head of the European Commission, Ursula von der Leyen, and U.S. President Donald Trump. The deal imposes a 15% tariff on European goods while lowering EU tariffs on U.S. cars and industrial goods to zero; some EU goods including aircraft, cork and generic pharmaceuticals, were exempted from the 15% rates. The deal has had a mixed reception in Europe, with business associations saying it imposes high costs that will impede exports to the U.S. Von der Leyen says that it will lower a painful 27.5% tariff on autos and bring stability and predictability for businesses. Lange however said “there is no security or predictability,” citing a U.S. decision two weeks after the deal was struck to include some 400 different goods containing steel such as pumps and motorcycle under a 50% steel and aluminum tariff instead of the 15% tariff.A top EU trade official urged the committee to approve the deal, saying the rate was low enough to keep trade flowing and maintain EU companies access to the U.S. market while avoiding a worse trade conflict. “You need to look at the alternative,” said Sabine Weyand, director general for trade. The agreement has been set down only in a 3 1/2 joint statement that left room for further talks on key issues. Trump faces questions about whether he exceeded his legal authorities by declaring a national emergency under a 1977 law to impose the broad tariffs. A U.S. appeals court on Friday upheld a previous lower court ruling that the president lacked the power to exact tariffs of that magnitude without going through Congress or using other legal mechanisms, a decision that Trump said Tuesday will in turn be appealed to the U.S. Supreme Court. Trump aroused concern Aug. 26 by threatening tariffs in response to EU digital regulation, which EU officials said were not part of the deal. “Where will it end - we are just getting more and more demands from Trump,” said deputy Saskia Bricmont, a member of the Greens/European Free Alliance group. Parliamentary action would be needed to implement the EU side of the tariffs deal. Lange did not say what the amendments might contain. The leader of one group in parliament, the center-left Socialists and Democrats, has come out against the deal but the group has only 136 seats in the 720-seat parliament and cannot stop the deal by itself. Lange is a member of the group. The European Commission underlined its determination to expand cooperative trade to other partners beyond the US, on Wednesday sending free trade deals with Mexico and the Mercosur trading bloc in Latin America for ratification by member states. The Mercosur deal would create what EU officials call the world’s largest free trade zone with 700 million people and lower high tariffs on EU farm exports in Latin America. It also would protect some politically sensitive EU farm products, particularly beef, in an attempt to mollify objections from EU farm lobbies in France and Poland. A limited amount of Mercosur beef - equal to around 1.5% of the European market - would face a moderate 7.5% tariff, but quantities above that would be hit with prohibitively high rates. There is also 6.3 billion euros in support for farmers in case of unexpected market disruptions.",
    "image": "/images/eu-trade-parliament.webp",
    "author": "Daniel C. Smith",
    "creator": "@Da_niel_Smith",
    "twitter": "https://x.com/Da_niel_Smith",
    "slug": "eu-us-trade-deal-doubts",
    "date": "Sept. 03, 2025"
  },
  {
    "category": "business",
    "title": "Gen Z’s credit scores are dropping. Here’s what to do if yours is too",
    "shortdescription": "Gen Z’s credit scores fell the most among generations, largely due to student loan debt, as federal collections resumed. Experts advise monitoring scores, paying on time, and keeping credit utilization low to improve financial health.",
    "description": "Gen Z has seen its credit scores drop more than any other generation over the past year, largely because of student loan debt, according to a new report out this week. The total national average credit score dropped two points this year to 715, according to the report from credit scoring company FICO. But Gen Z’s average score dropped three points to 676, the largest year-over-year decrease among any age group since 2020. A credit score is a mathematical formula that helps lenders determine how likely you are to pay back a loan. Credit scores are based on your credit history and range from 300 to 850. The report found that 34% of Gen Z consumers have open student loans, compared to 17% of the total population, and the decline in credit scores is primarily due to the resumption of student loan delinquency reporting. The U.S. Department of Education paused federal student loan payments in March 2020, offering borrowers relief during the economic chaos of the coronavirus pandemic. Though payments were set to resume in 2023, the Biden administration provided a one-year grace period that ended in October 2024. This summer, the Trump administration restarted the collection process for outstanding student loans, with plans to seize wages and tax refunds if the loans continue to go unpaid. Roughly 5.3 million borrowers who are in default could have their wages garnished by the federal government.Between student loans, a tough job market, and high inflation, young consumers are struggling to make payments on time, according to the report. A low credit score makes it more complicated or more expensive to obtain car loans, mortgages, credit cards, auto insurance, and other financial services. “They’ve had so many different ongoing causes of economic instability that have really been with them as they’ve been growing up; those factors make it a lot harder for this generation to stay financially stable,” said Courtney Alev, consumer advocate at Credit Karma. However, younger consumers also have the advantage of having the most potential for score improvement, Tommy Lee, senior director at FICO. If your credit score has dropped recently, here are some experts’ recommendations: Don’t avoid knowing your score. It’s common to be afraid of checking your credit score, but it’s best not to avoid it, Alev said. Knowing your current score, whether it’s good or not great, can help you make a plan for the future. “You need to know where you stand to be able to take action,” Alev said. Experian, FICO and Credit Karma are among the companies that let you check your credit score for free. While your credit score is essential to keep your financial life healthy, it’s important to remember that it’s just a number and it doesn’t define you as a person, added Alev.When it comes to the score calculation, one of the most critical factors is paying on time, whether that’s the minimum payment or the full balance. “The one most important factor in the FICO score calculation is whether you make your payments on time. And that’s about 35% of the score calculation,” Lee said. If you’re juggling several credit card payments and other debts, Alev recommends that you set automatic payments.Keeping your credit utilization low and avoiding acquiring new debt can help you increase your credit score. Credit utilization is the percentage of the credit you’re currently using from across all your available credit. While a low percentage is good for your credit score, it’s not recommended to have your credit utilization at 0%. Instead experts recommend you keep it between 10% and 30%. If you’re struggling to pay off the debt you currently have, it’s best if you don’t acquire more debt if you can avoid it. Credit scores change as your financial behavior does, so Lee recommends that if you’re not happy with your current credit score, you look to implement new habits in your financial life. “The FICO score is dynamic. It changes based on how you make your payments. So your score, if you want to maintain it or improve it, you can do so by exhibiting good credit behavior,” Lee said.",
    "image": "/images/gen-z-credit.webp",
    "author": "Daniel C. Smith",
    "creator": "@Da_niel_Smith",
    "twitter": "https://x.com/Da_niel_Smith",
    "slug": "gen-z-credit-score-drop",
    "date": "Sept. 19, 2025"
  },
  {
    "category": "business",
    "title": "US economy expanded at a surprising 3.8% pace in significant upgrade of second quarter growth",
    "shortdescription": "U.S. GDP grew 3.8% in Q2, boosted by stronger-than-expected consumer spending and falling imports, despite lingering trade war uncertainties and slowing job growth. Economists note mixed signals for future growth and Federal Reserve rate decisions.",
    "description": "An uptick in consumer spending helped the U.S. economy expand at a surprising 3.8% from April through June, the government reported in a dramatic upgrade of its previous estimate of second-quarter growth. U.S. gross domestic product — the nation’s output of goods and services — rebounded in the spring from a 0.6% first-quarter drop caused by fallout from President Donald Trump’s trade wars, the Commerce Department said Thursday. The department had previously estimated second-quarter growth at 3.3%, and forecasters had expected a repeat of that figure. The first-quarter GDP drop, the first retreat of the U.S. economy in three years, was mainly caused by a surge in imports — which are subtracted from GDP — as businesses hurried to bring in foreign goods before Trump could impose sweeping taxes on them. That trend reversed as expected in the second quarter: Imports fell at a 29.3% pace, boosting April-June growth by more than 5 percentage points. Consumer spending rose at a 2.5% pace, up from 0.6% in the first quarter and well above the 1.6% the government previously estimated. Spending on services advanced at a 2.6% annual pace, more than double the government’s previous estimate of 1.2%.“The U.S. consumer remained a lot stronger than many thought, even in the midst of a stock market sell-off and a lot of trade uncertainty,” Heather Long, chief economist at Navy Federal Credit Union, posted on social media. A category within the GDP data that measures the economy’s underlying strength came in stronger than previously reported as well, growing 2.9% from April-June, up from 1.9% in the first quarter and in the government’s previous estimate. This category includes consumer spending and private investment, but excludes volatile items like exports, inventories and government spending. But private investment fell, including a 5.1% drop in residential investment. Declining business inventories took more than 3.4 percentage points off second-quarter growth. Spending and investment by the federal government fell at a 5.3% annual pace on top of a 5.6% drop in the first quarter. Stephen Stanley, chief U.S. economist at Santander, noted that GDP growth averaged 1.6% in the first half of 2025 and consumer spending 1.5% — “not great but much better than initially thought.’ Since returning to the White House, Trump has overturned decades of U.S. policy in support of freer trade. He’s slapped double-digit taxes — tariffs — on imports from almost every country on earth and targeted specific products for tariffs, too, including steel, aluminum and autos. Trump sees tariffs as a way to protect American industry, lure factories back to the United States and to help pay for the massive tax cuts he signed into law July 4. But mainstream economists — whose views Trump and his advisers reject — say that his tariffs will damage the economy, raising costs and making protected U.S. companies less efficient. They note that tariffs are paid by importers in the United States, who try to pass along the cost to their customers via higher prices. Therefore, tariffs can be inflationary — though their impact on prices so far has been modest. The unpredictable way that Trump has imposed the tariffs — announcing and suspending them, then coming up with new ones — has left businesses bewildered, contributing to a sharp deceleration in hiring. From 2021 through 2023, the United States added an impressive 400,000 jobs a month as the economy bounded back from COVID-19 lockdowns. Since then, hiring has stalled, partly because of trade policy uncertainty and partly because of the lingering effects of 11 interest rate hikes by the Federal Reserve’s inflation fighters in 2022 and 2023. Labor Department revisions earlier this month showed that the economy created 911,000 fewer jobs than originally reported in the year that ended in March. That meant that employers added an average of fewer than 71,000 new jobs a month over that period, not the 147,000 first reported. Since March, job creation has slowed even more — to an average 53,000 a month. On Oct. 3, the Labor Department is expected to report that employers added just 43,000 jobs in September, though unemployment likely stayed at a low 4.3%, according to forecasters surveyed by the data firm FactSet. Seeking to bolster the job market, the Fed last week cut its benchmark interest rate for the first time since December and signaled that it expected two more cuts this year. But the surprisingly strong second-quarter GDP growth may give the central bank less reason to cut rates — despite intense pressure from Trump to do so. Fed officials will be watching even more closely than unusual when their favorite inflation gauge — the Commerce Department’s personal consumption expenditures (PCE) price index — comes out Friday. Thursday’s GDP report was Commerce Department’s third and final look at second-quarter economic growth. It will release its initial estimate of July-September growth on Oct. 30. Forecasters surveyed by the data firm FactSet currently expect the GDP growth to slow to an annual pace of just 1.5% in the third quarter.",
    "image": "/images/senate-gop-tax-bill-threatens-renewables.webp",
    "author": "Daniel C. Smith",
    "creator": "@Da_niel_Smith",
    "twitter": "https://x.com/Da_niel_Smith",
    "slug": "us-q2-gdp-growth",
    "date": "Sept. 25, 2025"
  },
  {
    "category": "business",
    "title": "How to navigate social media trends without derailing your budget",
    "shortdescription": "Social media-driven microtrends can influence spending habits, especially for Gen Z, sometimes leading to debt. Experts recommend pausing before purchases, aligning spending with personal values, and creating mindful barriers to shop intentionally.",
    "description": "Did you buy a new pink dress to watch the Barbie movie, only to never wear it again? An Oura ring because your favorite TikTok influencer had it? A new pair of baggy jeans because ‘90s fashion is making a comeback? Niche trends fueled by social media can influence your shopping decisions. Participating often brings some happiness and a sense of community, but the problem comes when you do it so often that you’re not using your money to achieve your financial goals, or worse, you get into debt, said Erika Rasure, chief financial wellness advisor for Beyond Finance, a financial services company.Whether it’s coastal grandma or clean girl aesthetic, microtrends can take a significant toll on already-strained budgets as prices rise and Gen Z struggles to pay off debt.Before you click “buy” on TikTok Shop, it’s best if you take some time to reflect, said Jennifer Seitz, head of education for Greenlight, a financial literacy app for families. Pausing before a purchase can help you discern if the item is something you really want or a fleeting craving.“Think if you want to put it in a schedule pause, whether it’s 24 hours or even a couple of days if it’s a larger expense,″ Seitz said. Participating in personal challenges can be a good way to get in the habit of making purchases more deliberate. Back in 2022, Alyssa Barber participated in the no-buy year challenge, where she pledged to stop buying non-essential items for a year. Barber shares sustainable practices with over 370,000 followers on TikTok, where one of her recurrent themes is how to stop impulse buying. Barber said the challenge gave her perspective on how much she was spending on things she didn’t need. Since then, she has changed her spending habits, focusing mainly on experiences.Taking a value-based spending approach can help you decide if you should participate in a trend you see online, Rasure said. If, for example, you want to build an emergency fund, having this goal in mind while shopping can help avoid unnecessary spending. Quynh Van, a 27-year-old UX designer from Minneapolis, was surprised by the number of ads on TikTok when she created an account after a four-year break from social media. And while being influenced by the ads is inevitable, she believes overspending comes in part from users not having defined goals. “When you don’t know who you are or what you like, you’re so driven by over-consumerism and lifestyle creep because you don’t have your values in order,″ Van said. Rasure recommends using your financial values as a guiding principle for your spending decisions. If you’re not sure of your values, allocate some time to map them out according to your life goals.If a purchase is one click away, it can make it easier to spend large amounts of money. If you consciously make it a little harder to pay for an item, you can spend more mindfully, Seitz said. “Just that action of needing to input your payment information rather than just that simple click can help you give to really stop and think about purchases before moving ahead with them,” she added. To add barriers, you can remove your credit card details from your computer browser or social media and disable Apple Pay on your phone.Finances are closely tied to emotions, and often, they evoke negative feelings such as shame or guilt. However, reframing them as an act of self-care can help you spend mindfully, Rasure said. “It can help you create boundaries around what you value spending money on, helps you choose intentionally and it feels more like freedom instead of restriction,″ she said. Your spending habits in the present can help your future financial situation. This mindset can inspire you when you’re tempted to overspend on the newest trending electronic or fashion item.It can be OK to engage with trends if they bring you positive feelings, Rasure said. Van decided to participate in the matcha trend, but with moderation. For Barber, physical media, such as old records, DVDs, and cassettes, is on her list of non-negotiable expenses, as she loves collecting these items. “Trends and engaging them, engaging in them really should spark that happiness or contentment, not the debt that can go with them,” Rasure said. The Associated Press receives support from Charles Schwab Foundation for educational and explanatory reporting to improve financial literacy. The independent foundation is separate from Charles Schwab and Co. Inc. The AP is solely responsible for its journalism.",
    "image": "/images/social-media-shopping-trends.webp",
    "slug": "gen-z-social-media-trends-spending",
    "date": "Oct. 06, 2025",
    "author": "Daniel C. Smith",
    "creator": "@Da_niel_Smith",
    "twitter": "https://x.com/Da_niel_Smith"
  },
  {
    "category": "business",
    "title": "As summers grow deadlier, here’s what to know about utility shutoffs",
    "shortdescription": "Rising electricity costs and extreme summer heat put low-income Americans at risk, as many states lack protections against utility shutoffs. Limited summer support from programs like LIHEAP leaves vulnerable households exposed.",
    "author": "Daniel C. Smith",
    "creator": "@Da_niel_Smith",
    "twitter": "https://x.com/Da_niel_Smith",
    "date": "Oct. 07, 2025",
    "slug": "summer-heat-low-income-utilities",
    "image": "/images/extreme-heat-low-income-utilities.webp",
    "description": "As the cost of electricity outpaces inflation and summers grow deadlier, consumer advocates are sounding alarms about the risks to low-income people who can’t afford consistent air conditioning in dangerous temperatures. While about half of U.S. states offer protections from utility shutoffs during extreme heat, the rest do not. In contrast, 41 states have “cold weather rules,” which forbid utility companies from shutting off household heat during extreme cold. The Low Income Home Energy Assistance Program (LIHEAP) provides funds for vulnerable groups who have trouble affording heating bills in the winter, but the program has less funding available to meet consumers’ increasing needs in the summer months. Shylee Johnson, 27, based in Wichita, Kansas, saw firsthand the protection that the local Low Income Energy Assistance Program (LIEAP) brought to her community during the three years she worked as a case manager for families who were behind on utility bills. “It was amazing at keeping people’s electricity on in the winter,” she said of the program, which subsidizes costs for households who can’t afford utility expenses. “Families would be deciding between paying their heating bill or another bill, and this took that decision away.”In the summer, though, Johnson said she’s seen how late or missed utility payments can result in the shutoff of electricity and the removal of vital services, despite air conditioning becoming increasingly essential to families’ health and well-being. “It’s terrifying,” she said. “There’s a ‘cold weather rule’ — in freezing temperatures, your heat can’t be turned off. But there isn’t an equivalent for summer in Kansas.” The clients Johnson served were often the most vulnerable, including families with young children, pregnant people, and those with sick or disabled family members, including some who need electricity to operate essential medical equipment in their homes. LIHEAP also sometimes provides air conditioning units in the summer for households that can’t afford to purchase their own units. Recent studies show that extreme heat in the summer is now the leading cause of weather-related deaths, according to the U.S. Environmental Protection Agency (EPA). That’s ahead of deaths due to extreme cold in the winter or other weather emergencies, like hurricanes or tornadoes. The frequency, duration and intensity of extreme heat waves has significantly increased over the past several decades, according to the EPA, and insignificant support for low-income households contributes to the danger. In 2023, the death certificates of more than 2,300 people who died in the summer mention the effects of excessive heat, the highest number in 45 years of records, according to an Associated Press analysis of Centers for Disease Control and Prevention data. And that figure is only a fraction of the real death toll, according to coroner, hospital, and ambulance records, also analyzed by the AP. Nationally, the cost of electricity has risen at twice the pace of the average cost of living, exacerbating the problem. According to the National Energy Assistance Directors Association (NEADA), which represents state program managers of LIHEAP, almost 20% of very low-income families lack consistent access to cooling. Currently, 26 states and the District of Columbia offer assistance with summer energy bills, while 21 states plus D.C. have policies protecting low-income families from utility disconnections during summer months. Still, roughly 85% of LIHEAP resources are used for heating in the winter, leaving little support for households seeking cooling, according to Mark Wolfe, executive director of NEADA. “Rules that were written thirty years ago, that were adequate for winter, are not adequate for the summer,” he said. “How do we protect vulnerable households both during periods of extreme heat and extreme cold? The rules haven’t caught up.” Karen Lusson, senior attorney at the National Consumer Law Center who focuses on energy and utility affordability, said that many deaths from extreme heat in the summer months are preventable. “The impression we’ve all had is that weather is most dangerous in the wintertime,” she said. “Not any more.” While the Trump administration fired the entire staff of the LIHEAP program in April, Wolfe and Lusson are hopeful Congress will approve slightly more funding for the program in the fall compared to the previous fiscal year, they said. To protect households during increasingly hotter summers, Lusson recommends individuals seek information about their rights when it comes to utility shutoffs. State utility commissions, which regulate public utilities, dictate local rules. To find your relevant commission, consult the government site operated by the national association of regulatory commissions, which has a state-by-state look-up tool. Lusson also encourages people to look into whether their state protections are calendar- or temperature-based, which can make a difference in planning. While some states forbid shut-offs during certain months of the year, others base the protections on the temperature of a given day or the presence of a heat advisory. This LIHEAP site has a break-down of every state’s policies. Some state attorney generals’ offices also have public utility bureaus that advocate on behalf of consumers, Lusson said. Lastly, it can be helpful to determine if your utility company offers discount rates or percentage-of-income payment plans to help with electricity bills. Both commission and utility websites have specific information about how to access LIHEAP assistance and whether or not the utility company itself offers assistance.The Associated Press receives support from Charles Schwab Foundation for educational and explanatory reporting to improve financial literacy. The independent foundation is separate from Charles Schwab and Co. Inc. The AP is solely responsible for its journalism."
  },
  {
    "category": "business",
    "title": "FAFSA application is open for early testing. Here’s what to know.",
    "shortdescription": "The 2026–27 FAFSA is now open for a limited beta test, with full access starting Oct. 1. The form determines eligibility for federal, state, and school financial aid, including loans and work-study programs.  ",
    "slug": "fafsa-2026-27-beta",
    "date": "Oct. 07, 2025",
    "author": "Daniel C. Smith",
    "creator": "@Da_niel_Smith",
    "twitter": "https://x.com/Da_niel_Smith",
    "image": "/images/fafsa-2026-27.webp",
    "description": "The Free Application for Federal Student Aid for the 2026-27 school year has opened for a limited number of students as part of a beta test, the Department of Education says. The department is rolling out two beta testing phases before the application is fully available to everyone in October. At first, the FAFSA form will be available for a small number of students and families, chosen via existing partnerships with community organizations and schools. “We’re using this time to monitor a limited number of FAFSA submissions to ensure our systems are performing as expected,” the department said on Monday. In September, students will be able to request participation in the second phase of beta testing. Participation will be limited, so not everyone will be accepted, said the Education Department.The FAFSA is a free government application that uses students’ and their families’ financial information to determine whether they can get financial aid from the federal government to pay for college. The application will send a student’s financial information to the schools they are interested in attending. The amount of financial aid a student receives depends on each institution. The application is also used to determine eligibility for other federal student aid programs, like work-study and loans, as well as state and school aid. Sometimes, private, merit-based scholarships also require FAFSA information to determine if a student qualifies.The 2026–27 FAFSA form will be available to everyone by Oct. 1. The deadline to submit the FAFSA form is June 30, 2026.Anyone planning to attend college next year should fill out the form. Both first-time college students and returning students can apply for the FAFSA. Students and parents can use the federal student aid estimator to get an early approximation of their financial package.The Associated Press receives support from Charles Schwab Foundation for educational and explanatory reporting to improve financial literacy. The independent foundation is separate from Charles Schwab and Co. Inc. The AP is solely responsible for its journalism."
  },
  {
    "category": "business",
    "title": "What the Fed rate cut will mean for your finances",
    "date": "Oct. 07, 2025",
    "shortdescription": "The Federal Reserve cut its benchmark interest rate to 4.1% for the first time in nine months, aiming to balance high inflation and a cooling job market. Borrowers may see gradual relief on mortgages, student loans, and credit cards, while savers could face lower yields on CDs and savings accounts.",
    "slug": "fed-cuts-interest-rate-2025",
    "author": "Benedict Johnson",
    "creator": "@benedictjo63174",
    "twitter": "https://x.com/benedictjo63174",
    "image": "/images/fed-interest-rate-cut-2025.webp",
    "description": "The Federal Reserve cut its benchmark interest rate Wednesday for the first time in nine months. Since the last cut, progress on inflation has slowed while the labor market has cooled. That means Americans are dealing with both high prices and a challenging job market. The federal funds rate, set by the Federal Reserve, is the rate at which banks borrow and lend to one another. While the rates that consumers pay to borrow money aren’t directly linked to this rate, shifts in Fed policy affect what people pay for credit cards, auto loans, mortgages, and other financial products. Wednesday’s quarter-point cut is the first since December and lowers the Fed’s short-term rate to about 4.1%, down from 4.3%. The Fed projected it will cut rates two more times before the end of the year. The Fed has two goals when it sets the rate: one, to manage prices for goods and services, and two, to encourage full employment. This is known as the “dual mandate.” Typically, the Fed might increase the rate to try to bring down inflation and decrease it to encourage faster economic growth and more hiring. The challenge now is that inflation is higher than the Fed’s 2% target but the job market is weak, putting the Fed in a difficult position. “The dual mandate is always a balancing act,” said Elizabeth Renter, senior economist at personal finance site NerdWallet.For prospective homebuyers, the market has already priced in the rate cut, which means it’s “unlikely to make a noticeable difference for most consumers at the time of the announcement,” according to Bankrate financial analyst Stephen Kates. “Much of the impact on mortgage rates has already occurred through anticipation alone,” he said. (Mortgage) rates have been falling since January and dropped further as weaker-than-expected economic data pointed to a cooling economy.” Still, Kates said a declining interest rate environment will provide some relief for borrowers over time.“Whether it’s a homeowner with a 7% mortgage or a recent graduate hoping to refinance student loans and credit card debt, lower rates can ease the burden on many indebted households by opening opportunities to refinance or consolidate,” he said.For savers, falling interest rates will slowly erode attractive yields currently on offer with certificates of deposit (CDs) and high-yield savings accounts. Right now, the best rates on offer for each have been hovering at or above 4% for CDs and at 4.6% for high-yield savings accounts, according to DepositAccounts.com. Those are still better than the trends of recent years, and a good option for consumers who want to earn a return on money they may want to access in the near-term. A high-yield savings account generally has a much higher annual percentage yield than a traditional savings account. The national average for traditional savings accounts is currently 0.38%. There may be a few accounts with returns of about 4% through the end of 2025, according to Ken Tumin, founder of DepositAccounts.com, but the Fed cuts will filter down to these offerings, lowering the average yields as they do. Auto loans are not expected to decline soon. Americans have faced steeper auto loan rates over the last three years after the Fed raised its benchmark interest rate starting in early 2022. Those are not expected to decline any time soon. While a cut will contribute to eventual relief, it might be slow in arriving, analysts say. “If the auto market starts to freeze up and people aren’t buying cars, then we may see lending margins start to shrink, but auto loan rates don’t move in lockstep with the Fed rate,” said Bankrate analyst Stephen Kates. Prices for new cars have leveled off recently, but remain at historically high levels, not adjusting for inflation. Generally speaking, an auto loan annual percentage rate can run from about 4% to 30%. Bankrate’s most recent weekly survey found that average auto loan interest rates are currently at 7.19% on a 60-month new car loan. Credit card rate relief could be slow. Interest rates for credit cards are currently at an average of 20.13%, and the Fed’s rate cut may be slow to be felt by anyone carrying a large amount of credit card debt. That said, any reduction is positive news. “While the broader impact of a rate reduction on consumers’ financial health remains to be fully seen, it could offer some relief from the persistent budgetary pressures driven by inflation,” said Michele Raneri, vice president and head of U.S. research at credit reporting agency TransUnion. “These savings could contribute to a reduction in delinquency rates across credit card and unsecured personal loan segments,” she said. Still, the best thing for anyone carrying a large credit card balance is to prioritize paying down high-interest-rate debt, and to seek to transfer any amounts possible to lower APR cards or negotiate directly with credit card companies for accommodation."
  },
  {
    "category": "business",
    "title": "Cold shoulder from Canada is costly for American distillers struggling with global trade tensions",
    "shortdescription": "U.S. distilled spirits exports plunged in 2025, with Canadian shipments falling 85% amid trade tensions and lingering tariffs. American distillers, both large and small, face challenges regaining lost market share despite easing trade restrictions.",
    "date": "Oct. 06, 2025",
    "slug": "us-spirits-exports-drop-canada-2025",
    "image": "/images/us-spirits-exports-canada-2025.webp",
    "author": "Benedict Johnson",
    "creator": "@benedictjo63174",
    "twitter": "https://x.com/benedictjo63174",
    "description": "American distillers have gotten a costly cold shoulder from Canada, where their exports plunged 85% earlier this year — topping broad declines in key international markets amid global trade tensions, a spirits industry group said Monday.Even a thaw in trade relations may not shake this hangover right away. “Even though things have eased up, we still are not back on the shelf in Canada,” said Kentucky craft distiller Tom Bard. “Probably won’t be for a good long while.” The majority of Canadian provinces continue to ban American spirits from shelves, though Canada removed its retaliatory tariff on the products weeks ago, the Distilled Spirits Council of the United States said. There’s another nagging concern — that consumer reaction to the trade conflicts could curb the international thirst for American spirits in key markets. Overall exports of American spirits fell 9% in the second quarter of 2025 compared to a year ago, the council said in its new report. Sharp declines occurred in other crucial markets — the European Union, United Kingdom and Japan, it said. That comes on the heels of a banner year for U.S. spirits exports in 2024, the council said. Total first-quarter exports in 2025 edged up by 1% from a year ago. In the ultracompetitive spirits world, the sudden drop-off is a dispiriting development for U.S. distillers.“There’s a growing concern that our international consumers are increasingly opting for domestically produced spirits or imports from countries other than the U.S., signaling a shift away from our great American spirits brands,” Chris Swonger, the council’s CEO, said Monday in a release. Canada remains the only key trading partner that retaliated against U.S. spirits in the latest rounds of trade conflicts spurred by President Donald Trump’s tariff policies. The president maintains that open trade cost the U.S. millions of factory jobs and that tariffs are the path to American-made prosperity. But American distilled spirits have been a high-profile target for retaliation. Trump’s first-term tariffs on European steel and aluminum spurred the EU to retaliate with a tariff that caused American whiskey exports to the EU to plunge, costing distillers more than $100 million in revenue from 2018 to 2021, the council has said. Once the tariff was suspended, EU sales rebounded for American distillers — until the latest tensions resurfaced in the first year of Trump’s second term. The Distilled Spirits Council is pressing for free-flowing trade for distilled spirits with zero-for-zero tariffs with key markets, saying it would give American distillers the certainty they need. Global markets are increasingly vital for producers of American whiskey — which includes bourbon, Tennessee whiskey and rye whiskey. The sector faces a supply-and-demand crunch in the U.S., where a sales slowdown is coinciding with massive stockpiles of whiskey, the council said. “With the slowdown in the U.S. market, it’s more important than ever for American distillers to have reliable access to international markets,” Swonger said. “Until these trade issues are fully resolved, many distillers are remaining on the sidelines, fearful that without a permanent return to zero-for-zero tariffs, they could once again face retaliatory tariffs. They simply don’t want to risk jeopardizing the investments they’d need to make to reestablish their presence abroad.” The most dramatic quarterly drop off in exports occurred in Canada, where U.S. spirits exports fell below $10 million amid the 85% plunge in the April-through-June quarter, the report showed. Elsewhere, exports of American spirits to the European Union — the U.S. industry’s largest export market — fell 12% in the second quarter, the council said. Exports to the United Kingdom dropped 29% and exports to Japan decreased 23%, it said. The pain was felt across a range of spirits categories, with quarterly declines of 13% for American whiskey, 14% for vodka, 15% for cordials and 12% for brandy, it said. The declines were softened somewhat by surging sales to other countries — including Mexico, Australia, Brazil, Singapore and South Korea, the council said. Distilled spirits were exported from 43 states last year, with Tennessee and Kentucky ranking first and second, respectively, the report said. Texas was third, followed by Florida and Indiana. Large and small producers alike are feeling the pinch from trade conflicts. In August, Brown-Forman Corp. reported a 3% drop in first-quarter net sales, but company CEO Lawson Whiting said it is positioned for “resilient results in the face of persistent headwinds.” It posted double-digit net sales drops in Germany and the United Kingdom and a nearly 60% decline in Canada. Brown-Forman produces such brands as Jack Daniel’s Tennessee Whiskey and Woodford Reserve bourbon. But large distillers possess the capital and market reach to ride out disruptions caused by trade disputes — built-in luxuries that most small producers don’t have. For Bard, the trade tensions abruptly halted his momentum in securing and expanding his foothold in Canada. He and his wife, Kim, own The Bard Distillery in western Kentucky. Their brands include Muhlenberg and Cinder & Smoke bourbons. At the start of 2025, their products were sold in British Columbia and Alberta, and they were in talks to expand to other Canadian provinces. The plan was to ship more than 1,000 cases — mostly bourbon along with flavored whiskeys and cream liqueurs — north of the border this year, perhaps turning their Canadian business into 15% to 20% of overall sales in 2025. It was an ambitious plan for a small distiller, but it evaporated amid the trade conflict and Canadian backlash to Trump’s repeated comments that their country should be the 51st U.S. state. The Bards haven’t been able to offset those losses in the U.S. They’re in the early stages of trying to break into other countries, he said, but that takes time. In the meantime, they’ve left two production jobs unfilled, mostly because of lost revenue from Canada, he said. Reclaiming lost market share is never easy and he’ll have to “start from square one,” Tom Bard said. “I would say it will be next year and we will have to physically go up there and spend a lot of time trying to get back on the shelf,” he said."
  },
  {
    "category": "business",
    "title": "Lula asks Trump to lift 40% tariff on Brazilian imports",
    "shortdescription": "Brazilian President Lula da Silva urged U.S. President Donald Trump to lift the 40% tariff on Brazilian imports during a 30-minute call, emphasizing trade ties and inviting Trump to the upcoming climate summit in Belem.",
    "date": "Oct. 06, 2025",
    "slug": "lula-trump-trade-tariff-talks",
    "image": "/images/lula-trump-trade-meeting.webp",
    "description": "Brazilian President Luiz Inácio Lula da Silva asked U.S. President Donald Trump during a phone conversation Monday to lift the 40% tariff imposed by the U.S. government on Brazilian imports. The leaders spoke for 30 minutes, exchanged phone numbers, and Lula reiterated his invitation for Trump to attend the upcoming climate summit in Belem, according to a statement from Lula’s office. Later, Trump posted on Truth Social that he had had a good conversation with Lula. “We discussed many things, but it was mostly focused on the Economy, and Trade, between our two Countries,” Trump wrote, adding that the leaders “will be having further discussions, and will get together in the not too distant future, both in Brazil and the United States.” The Trump administration had imposed a 40% tariff on Brazilian products in July on top of a 10% tariff imposed earlier. Lula reminded Trump that Brazil was one of three G20 countries with which the U.S. maintains a trade surplus. The Trump administration justified the tariffs saying that Brazil’s policies and criminal prosecution of former President Jair Bolsonaro constitute an economic emergency. Earlier this month Bolsonaro was convicted of attempting a coup after losing his bid for reelection in 2022 and a panel of the Supreme Court sentenced him to 27 years and three months in prison. Lula also offered to travel to Washington to meet with Trump, to continue the conversation they started when they met at the United Nations General Assembly earlier this month.",
    "author": "Benedict Johnson",
    "creator": "@benedictjo63174",
    "twitter": "https://x.com/benedictjo63174"
  },
  {
    "category": "business",
    "title": "Thousands of jobs at risk in Africa as US trade deal expires",
    "shortdescription": "The U.S. is ending the African Growth and Opportunity Act, a key trade deal granting African exports duty-free access since 2000. Its expiry threatens industries like Kenya’s textile sector, which relies heavily on U.S. markets, leaving over a million jobs across Africa at risk.",
    "description": "Workers and industry are bracing for the end of a longstanding U.S. trade agreement that gave African exporters preferential treatment and now leaves businesses vulnerable to new competitive pressures and tariffs. The African Growth and Opportunity Act will terminate as scheduled Tuesday amid uncertainty over renegotiations and the looming impact of new tariffs announced by the White House in April. AGOA is a multilateral trade agreement that has given thousands of products from qualifying African nations duty-free access to U.S. markets since 2000. A key example of the deal’s impact can be found in Kenya, where it has allowed the country’s textile and apparel sector — makers of jeans, for instance — to effectively compete with Asian exporters such as in Bangladesh and Vietnam. “If AGOA goes away we have zero chance to compete with the Asian countries,” said Pankaj Bedi, owner of United Aryan, an apparel manufacturer in Nairobi that exports Levi’s and Wrangler jeans to the U.S. Textile and apparel exports from Kenya to the U.S. have grown from around $50 million when AGOA was first introduced to around $500 million today.“I will be asking (Trump) for the U.S. to consider seriously renewing and extending AGOA for at least a minimum of five years,” Kenyan President William Ruto said last week at the U.N. General Assembly. “It is a platform that connects Africa and the U.S. in a very fundamental way.” AGOA had also given African countries hope that major elements of their export economies would be exempt from blanket tariffs of 10% — and in some cases much higher — announced by the U.S. earlier this year. Kenya is already paying 10% on non-AGOA exports, which are not many. Kenyan manufacturers will struggle to compete with rivals in Asia, even though some Asian countries may face a higher U.S. tariff, because of the limited domestic supply chain in Kenya where most of the raw materials are imported, as well as higher energy costs, lending rates, and operating expenses. Ruto and other African leaders are pushing for a last-minute renegotiation of AGOA while also scrambling to sign new bilateral agreements with the U.S. They are doing so amid a period of seismic change in global trade dynamics and with a White House that shows a mixed commitment to Africa. “African countries including Kenya must be alive to the possibility that AGOA won’t be extended, AGOA won’t be remodified, and … America won’t be interested in having a trade pact,” said Raphael Obonyo, a public policy expert at UN Habitat. Ruto said last week that Kenya and the U.S had made “good progress” toward a bilateral agreement that could be signed by the end of this year. AGOA has mostly benefitted African economies in both big and small industries. The agreement has helped both the continent’s largest exporters — Nigerian and Angolan oil, South African autos, and Kenyan clothing—as well as some of its smallest economies where exports are highly concentrated, such as Lesotho and Eswatini. Some African economies, like Nigeria and Lesotho, are likely to face “notable adverse effects” from the end of AGOA and new U.S. tariffs, researchers at the German Institute of Development and Sustainability wrote in a brief. While there may be limited macroeconomic effects across Africa as a whole from changes to U.S. trade, these assumptions “likely understate the full impact of new Trump-era tariffs and do not capture the indirect effects like reduced foreign investment, weakened supply chains, rising poverty, or the loss of capacity-building,” the researchers added. AGOA-dependent industries likely employ some 1.3 million people whose jobs are now at risk — in countries where many people have few if any other options in the case of sudden unemployment. In Kenya, more than 66,000 people, many of them women, were employed through now-vulnerable textile and apparel exporters to the U.S. In the garment districts of Kenya’s bustling capital, job cuts and fears over livelihoods have already begun. United Aryan said this week that it will shed some 1,000 jobs or 10% of its workforce amid trade uncertainty. “There is no way we can survive,” added Bedi, who is also the apparel export sub-chair at the Kenya Association of Manufacturers. For Julia Shigadi, a machinist at United Aryan, the end of AGOA is an existential threat. “This has been my bread and butter,” said Shigadi. “I only depend on this job—so if it is gone, it means my life is gone too.”",
    "image": "/images/agoa-trade-deal-ends-kenya.webp",
    "slug": "us-ends-african-trade-deal-agoa",
    "date": "Oct. 01, 2025",
    "author": "Benedict Johnson",
    "creator": "@benedictjo63174",
    "twitter": "https://x.com/benedictjo63174"
  },
  {
    "category": "business",
    "title": "Trump finds new trade targets -- pharmaceuticals, kitchen cabinets and heavy trucks",
    "shortdescription": "President Donald Trump’s new tariffs — including 30% on upholstered furniture and 100% on pharmaceuticals — have rattled U.S. businesses like Naturepedic, forcing tough pricing and production decisions. The sweeping levies aim to boost U.S. manufacturing but risk raising consumer costs.",
    "description": "Naturepedic, a mattress and furniture company based outside Cleveland, has been planning to introduce an upscale upholstered headboard late this year or early in 2026. But President Donald Trump has thrown those plans into disarray. On Thursday night, the president announced on social media that he was slapping a 30% tax on imported upholstered furniture. Naturepedic ships its headboards in from India and Vietnam. So what is the company to do? “Do we continue forth ... and hope for the best?’’ asked Arin Schultz, Naturepedic’s chief growth officer. “Or do we feel like we’re priced out and drop it altogether?’’ And if Naturepedic decides to continue with the rollout, “do we eat the cost or pass it on’’ to customers? Across the United States, lots of executives were asking themselves similar questions as they came to work Friday morning. Upholstered furniture, after all, wasn’t the only import in Trump’s crosshairs Thursday night. In addition, the president posted on his Truth Social platform, he’s plastering import taxes – tariffs – of 100% on pharmaceutical drugs, 50% on kitchen cabinets and bathroom vanities and 25% on heavy trucks.And he’s not waiting around to do it. The tariffs, he said, would take effect Wednesday. Trump also raised eyebrows by justifying the levy on vanities and sofas as necessary for national security. “It’s hard to see how a kitchen cabinet industry is essential to winning the next war,’’ said Mary Lovely, senior fellow at the Peterson Institute for International Economics. Thursday’s social media barrage was j ust the latest in Trump’s push to upend American trade policy, which for decades pushed for lower trade barriers around the world. In place of an open market, Trump has built a tariff wall around the U.S. economy, slapping double-digit taxes on imports from almost every country on earth and targeting products (steel, aluminum, autos) with specific taxes of their own. Trump says the tariffs will protect U.S. industries from foreign competition, encourage companies to bring production to the United States and raise money for the U.S. Treasury. They certainly have become a moneymaker for the federal government. Since fiscal year 2025 began last Oct. 1, the U.S. Treasury has collected $172 billion in customs duties, up by $96 billion (or 126%) from the same period in fiscal 2024. Still, tariffs account for less than 4% of federal revenue. Businesses, lawyers and trade analysts are still wondering what to make of Trump’s Thursday night tariffs. “We’ve only seen the President’s Truth Social posts,” said Dan McCarthy, principal in McCarthy Consulting and a former official with the Office of the U.S. Trade Representative in the Biden administration. “We need to see the details.’’ For example, Naturepedic isn’t sure whether the 30% levy on upholstered furniture will be stacked atop a separate and earlier 50% tariff on goods from India.The president has been threatening tariffs of 200% or more on pharmaceuticals. “It’s to force Big Pharma to move jobs and put new factories into the U.S,’’ said Barry Appleton, a senior fellow at the Center for International Law at New York Law School. “So it’s industrial policy.” In recent decades, drugmakers have moved many operations overseas – to take advantage of lower costs in China and India and tax breaks in Ireland and Switzerland. The COVID-19 experience – when countries were desperate to hang onto their own medicine and medical supplies — underscored the dangers of relying on foreign countries in a crisis, especially when a key supplier is America’s geopolitical rival China. The stock prices of pharmaceutical companies actually rose after Trump’s announcement Thursday night. The 100% tariff was lower than it might have been. And Trump said the tariffs would not apply to companies “breaking ground” or being “under construction.” Several big drugmakers like Merck & Co. Inc., Eli Lilly and Co. and Johnson & Johnson have already announced U.S. expansion plans. In his tariff announcement, Trump did not mention generic drugs, which account for the vast majority of U.S. prescriptions. Still, analysts warn, the tariffs are likely to mean higher prices. “The people who are punished the most are Americans who need the drugs so badly, especially those who don’t have full health care plans,” Appleton said. He called the tariff is a “simplistic but drastic” approach to a complicated problem. “We don’t know how it’s going to go, but it doesn’t look like it’s going to do well for consumers,” he said.The tariffs on kitchen cabinets, bathroom vanities and upholstered furniture come as the White House is investigating whether imports of lumber and other wood products pose a threat to U.S. national security. A report on that investigation is due Nov. 26 and could mean more and broader tariffs. The levies are likely to hurt big furniture exporters China and Vietnam. But they’re also likely to drive up the cost of new homes and apartments and of do-it-yourself redecorating projects. Homeowners are already scaling back due to high costs and a shaky economy. According to the Labor Department, the price of living room, kitchen and dining room furniture has risen nearly 10% over the past year. “Adding significant costs to furniture, cabinets, vanities and building materials will make the American dream of owning a home significantly more expensive,” said Jonathan Gold, the National Retail Federation’s vice president of supply chain and customs policy. “The speed at which these tariff announcements are made and implemented continues to wreak havoc on retail supply chains. The uncertainty makes it difficult for retailers to properly plan and mitigate the impact of tariffs.”Charles Clevenger, a supply chain specialist at the consultancy UHY, said tariffs on pharmaceuticals make sense because so much production has shifted away from the United States to Europe and Asia. Likewise, North Carolina and other states in the American South have also lost furniture factories to cheaper competitors in the China. But he was surprised by the tariffs on heavy trucks because “we do have a rather robust industry’’ – with manufacturers like Paccar (parent company of Peterbilt and Kenworth). But Appleton at New York Law School suspects the tariff is aimed at Mexico, where many heavy trucks are made. The U.S.-Mexico-Canada Agreement, a trade deal negotiated in Trump’s first term, is coming up for negotiation. “I don’t think that (the tariff) was done by accident, Appleton said. “They wanted to put some more pressure onto the Mexicans” to make concessions in the talks. Using Section 232 of the Trade Expansion Act of 1962, Trump had launched investigations into whether imports of pharmaceuticals, lumber and heavy trucks posed a threat to U.S. national security. He’d justified his broader tariffs another way: by declaring national emergencies under a 1977 law. But two courts have ruled that Trump overstepped his authority by invoking the International Emergency Economic Powers Act (IEEPA) to impose import taxes. The Supreme Court is hearing the case on appeal. Robert Lawrence, a professor of International trade and investment at Harvard University, said that using Section 232 gives the president a Plan B if the courts strike down his IEEPA tariffs. “He now has insurance and shows that he’s going to be able to get away with raising tariffs, even if he loses that case.” But Ted Murphy, co-leader of the trade practice at the Sidley Austin law firm, said: “It’s hard to discern much of a plan ... What the administration does is they identify a problem and then the solution is a big tariff. The question is whether that’s really as nuanced or strategic as it could be. There could be a strategy but it’s hard to discern from a tweet.’’",
    "image": "/images/trump-furniture-drug-tariffs.webp",
    "slug": "trump-tariffs-hit-furniture-and-drug-imports",
    "date": "Sept. 27, 2025",
    "author": "Benedict Johnson",
    "creator": "@benedictjo63174",
    "twitter": "https://x.com/benedictjo63174"
  },
  {
    "category": "business",
    "title": "How ‘The Great Lock In’ can help achieve your financial and wellness goals",
    "shortdescription": "A viral TikTok trend called “The Great Lock In” is motivating people to refocus on goals before 2025 ends — not just fitness or wellness, but finances too. Experts say setting realistic, trackable goals, building habits, and staying accountable online can help participants end the year stronger and carry those habits into 2026.",
    "description": "As the end of 2025 approaches, a viral TikTok trend is helping people achieve their wellness goals: “The Great Lock In” encourages participants to finish the year strong by fully focusing on their life goals from Sept. 1 through Dec. 31. Many people focus on exercise or eating healthier. But the trend can also help you achieve your financial goals. There are no set rules for “The Great Lock In.” The phrase “lock in” is popular on social media and it means to focus intensely on a task. “Something I like about this particular trend is that it’s like New Year’s resolutions’ little sister,” said Lindsay Bryan-Podvin, financial therapist and founder of Mind Money Balance, a financial wellness podcast and blog. For Julissa Mercedes, 28, one of her lock in goals is to build an $2,500 emergency savings fund. “Having some liquid cash will make me feel a little bit safer,” said Mercedes, a San Diego resident who works in finance. Aside from building an emergency fund, Mercedes has three other goals: making a new friend, creating a morning routine, and picking up a new hobby. “The Great Lock In” is meant to help people achieve New Year’s resolutions that might have fallen by the wayside. If you started your year planning to pay down debt by cutting unnecessary expenses, and have yet to follow up on that, this challenge might help you with that goal. “I think that’s appealing to a lot of people who are just tired of feeling stuck and like they haven’t been able to make any progress,” said Ben Markley, personal finance educator and host of Sketchy Advice by YNAB, a budgeting app. If you’re thinking of participating in “The Great Lock In,” or if you’re already doing it, here are some expert recommendations to make your financial goals stick. To build a goal that will benefit you, it’s essential to review your finances, Bryan-Podvin said. She suggested that you review your bank account and spend some time figuring out how much you earn each month, as well as what you spend it on. If you made a New Year’s resolution around finances, this could be a good opportunity to check on your progress and see if you need to reassess your approach. When participating in a challenge, it’s best to set attainable goals, Markley said. Sometimes online challenges inspire people to make significant changes, but they can also lead them to create unattainable goals. “A lot of people can’t sustain that at all, so they drop off,” he said. “Or, they do sustain it, but then they go back to their normal life after the challenge, and their spending habits haven’t fundamentally changed.” Setting a goal that is realistic in relation to your budget and lifestyle is the best way to make sure you can achieve it by the end of the challenge. Bryan-Podvin recommends looking at “The Great Lock In” as a 5K race rather than a marathon. To continue achieving your financial goals into 2026, Markley recommends centering some of your lock in goals around building new habits or skills. For example, if your goal is to stop spending on takeout, focus on building a habit that’s related to cooking. “Find easy meals that you could cook at home with your skill level so that when you want to eat out, you have that to fall back on,” Markley said. A great way to help create a habit is to use a habit-tracking tool. It can be as simple as setting reminders on your phone or downloading an app that sends you regular notifications, Bryan-Podvin said. Social media can be a good place to find community support for achieving your goals, whether it’s joining a Facebook group, commenting on creators’ videos, or posting your own content. As she started “The Great Lock In” challenge at the beginning of September, Mercedes also decided to document her experience on TikTok. Sharing her journey with followers helps with accountability, she said. “Seeing that people are still watching and keeping up with my content makes me feel like they’re part of the journey too,” Mercedes said. As you use “The Great Lock In” trend to achieve your financial goals, take a moment to reflect on your overall relationship with money. “Give every dollar a specific job so that you’re not going on autopilot when you spend, you’re being intentional with your money and making sure that it’s going towards the things you need and the things you care about,” Markley said. Sitting down regularly, either by yourself or with your partner, and reviewing your spending habits can help with your long-term financial goals. If you try this challenge and you find out it doesn’t work for you, that is OK, Markley said. “You can find something else that works, and it’s no reflection on your character if you don’t pull off ‘The Great Lock-In,’” he added. While social media challenges can help inspire people to achieve their goals, it’s not worth adding unnecessary stress to your life because of a challenge. Not every trend works for everyone, and there are many other ways that you can achieve your financial goals, Markley said.",
    "image": "/images/great-lock-in-financial-challenge.webp",
    "slug": "the-great-lock-in-financial-goals-trend",
    "date": "Sept. 23, 2025",
    "author": "Benedict Johnson",
    "creator": "@benedictjo63174",
    "twitter": "https://x.com/benedictjo63174"
  },
  {
    "category": "business",
    "title": "From Toys to Automobiles, Tariffs Are Cutting Deep Into Corporate Profit Margins",
    "shortdescription": "New tariffs imposed by the Trump administration are burdening U.S. companies across sectors—from toy makers to automakers—forcing cost‑cutting, margin compression, and strategic shifts as profits erode under pressure.",
    "description": "As the Trump administration’s tariff policies take deeper hold across the U.S. economy, companies from the toy industry to automakers are reporting sharp declines in profit margins and mounting pressure to absorb or shift costs. Companies such as Hasbro and Mattel have flagged substantial financial losses tied to steep import duties on Chinese goods—tariffs set at roughly 30% have frozen supply chains and slashed revenue at major retailers. Hasbro said the tariffs cost it approximately $1 billion in one quarter and is projecting an additional $60 million impact this year—figures that have rippled through its manufacturing and sourcing strategies. Many toy firms have responded by eliminating accessory items, removing batteries from sets, simplifying packaging, and phasing out extras to preserve price points and maintain retailer shelf placements Toy makers serving Walmart, Target, and Amazon are redesigning product lines; Popular Playthings trimmed items like serving plates or powered features while raising list prices—higher costs now fall on consumers or eat into margins Industry observers note that about 80% of U.S. toys are imported from China, making the sector especially vulnerable to import duties In the auto industry, tariffs have become a double‑edged sword. U.S. automakers like General Motors and Stellantis reported multi‑billion dollar hits tied to tariffs on imported vehicles and parts, with GM’s Q2 net income down 35% due in part to duties that may cost the company up to $5 billion annually :[oaicite:3]{index=3}. Meanwhile, Volkswagen disclosed a €1.3 billion blow to operating profits and sharply cut its 2025 margin outlook, with Audi and Porsche units seeing year‑on‑year declines up to 64% and 91% :[oaicite:4]{index=4}. The firm plans investments in U.S. production to negotiate separate agreements with Washington and sidestep elevated import duties Analysts warn that while automakers from Japan and Europe now face 25–27.5% import tariffs, recent reductions for Japanese vehicles to 15% offer only marginal relief and may disadvantage U.S.-assembled vehicles still subject to higher rates Deutsche Bank researchers underline that U.S. importers—not foreign exporters—carry most tariff pressures, absorbing costs and compressing domestic profit margins rather than passing them fully to consumers :[oaicite:7]{index=7}. The bank’s analysis challenges government claims that exporters bear the burden and predicts delayed but inevitable price increases at the consumer level. Indeed, while major global companies have absorbed the tariffs so far, cost‑shifting is expected to accelerate in coming months as margins erode and inflation signals rise :[oaicite:8]{index=8}. In response to tightened margins, firms are pursuing cost‑cutting measures: toy makers remove batteries or accessories; companies simplify packaging; and automakers lean on supply chain adjustments. Businesses are delaying launch of planned products, reducing included components, and scaling back inventory to offset duty spikes—moves that have led to delayed holiday offerings and reduced product innovation :[oaicite:9]{index=9}. At the macro level, economists highlight that the average U.S. import tariff has surged to nearly 17%, up from about 2.3% just a year ago. Inflation edged up to 2.7% in June, with analysts attributing some of that rise to looming price increases from tariff‑affected goods Small and medium-sized companies, especially in retail and manufacturing, report being stretched thin by the regulatory burden, with some shelving expansion or importing fewer product lines to limit exposure Experts emphasize that unless tariffs are scaled back or companies secure exemptions, the continued cost will erode profitability across broad sectors, from toys and auto parts to apparel and electronics. Furthermore, trade policy shifts have injected uncertainty into investment and supply chain planning, as firms consider reshoring, negotiating trade deals, or passing costs onto consumers over time. For automakers especially, restructuring supply chains to U.S.-based production is a long-term process requiring capital-intensive factories and skilled labor—a shift that may unfold over multiple years, with short‑term pain persisting until new domestic production ramps up :[oaicite:12]{index=12}. The broader economic impact is also visible: U.S. importers absorb much of the tariff burden, reducing profit margins across manufacturing and retail, while consumer prices are expected to rise further as firms gradually adjust pricing strategies. Some companies continue to absorb costs to remain competitive, but this strategy is increasingly unsustainable. The cumulative consequence: weakened corporate bottom lines, reduced investment in innovation, delayed product releases, and pressure to reorganize global sourcing networks. Investors and industry stakeholders are monitoring whether government relief or trade agreement negotiations—like revised deals with Japan, the EU or Canada—can stabilize conditions. Meanwhile, companies are voicing concerns to policymakers, urging clarity and contesting unilateral tariffs imposed via emergency authority. As the cost burden deepens, tariffs are reshaping strategy, profits, and competitive positioning across sectors—from the playroom to the assembly line.",
    "image": "/images/from-toys-to-automobiles-tariffs-are-cutting-deep-into-corporate-profit-margins.webp",
    "slug": "from-toys-to-automobiles-tariffs-are-cutting-deep-into-corporate-profit-margins",
    "date": "25th july 2025",
    "author": "Benedict Johnson",
    "creator": "@benedictjo63174",
    "twitter": "https://x.com/benedictjo63174"
  },
  {
    "category": "business",
    "title": "As summers grow deadlier, here’s what to know about utility shutoffs",
    "shortdescription": "As electricity costs soar and heat waves intensify, low-income Americans face growing risks from power shutoffs during summer. Unlike winter “cold weather rules,” most states lack protections against utility disconnections in extreme heat. Advocates say programs like LIHEAP must expand to address summer cooling needs as record heat deaths rise nationwide.",
    "description": "As the cost of electricity outpaces inflation and summers grow deadlier, consumer advocates are sounding alarms about the risks to low-income people who can’t afford consistent air conditioning in dangerous temperatures. While about half of U.S. states offer protections from utility shutoffs during extreme heat, the rest do not. In contrast, 41 states have “cold weather rules,” which forbid utility companies from shutting off household heat during extreme cold. The Low Income Home Energy Assistance Program (LIHEAP) provides funds for vulnerable groups who have trouble affording heating bills in the winter, but the program has less funding available to meet consumers’ increasing needs in the summer months. Shylee Johnson, 27, based in Wichita, Kansas, saw firsthand the protection that the local Low Income Energy Assistance Program (LIEAP) brought to her community during the three years she worked as a case manager for families who were behind on utility bills. “It was amazing at keeping people’s electricity on in the winter,” she said of the program, which subsidizes costs for households who can’t afford utility expenses. “Families would be deciding between paying their heating bill or another bill, and this took that decision away.”In the summer, though, Johnson said she’s seen how late or missed utility payments can result in the shutoff of electricity and the removal of vital services, despite air conditioning becoming increasingly essential to families’ health and well-being. “It’s terrifying,” she said. “There’s a ‘cold weather rule’ — in freezing temperatures, your heat can’t be turned off. But there isn’t an equivalent for summer in Kansas.” The clients Johnson served were often the most vulnerable, including families with young children, pregnant people, and those with sick or disabled family members, including some who need electricity to operate essential medical equipment in their homes. LIHEAP also sometimes provides air conditioning units in the summer for households that can’t afford to purchase their own units. Recent studies show that extreme heat in the summer is now the leading cause of weather-related deaths, according to the U.S. Environmental Protection Agency (EPA). That’s ahead of deaths due to extreme cold in the winter or other weather emergencies, like hurricanes or tornadoes. The frequency, duration and intensity of extreme heat waves has significantly increased over the past several decades, according to the EPA, and insignificant support for low-income households contributes to the danger. In 2023, the death certificates of more than 2,300 people who died in the summer mention the effects of excessive heat, the highest number in 45 years of records, according to an Associated Press analysis of Centers for Disease Control and Prevention data. And that figure is only a fraction of the real death toll, according to coroner, hospital, and ambulance records, also analyzed by the AP. Nationally, the cost of electricity has risen at twice the pace of the average cost of living, exacerbating the problem. According to the National Energy Assistance Directors Association (NEADA), which represents state program managers of LIHEAP, almost 20% of very low-income families lack consistent access to cooling. Currently, 26 states and the District of Columbia offer assistance with summer energy bills, while 21 states plus D.C. have policies protecting low-income families from utility disconnections during summer months. Still, roughly 85% of LIHEAP resources are used for heating in the winter, leaving little support for households seeking cooling, according to Mark Wolfe, executive director of NEADA. “Rules that were written thirty years ago, that were adequate for winter, are not adequate for the summer,” he said. “How do we protect vulnerable households both during periods of extreme heat and extreme cold? The rules haven’t caught up.” Karen Lusson, senior attorney at the National Consumer Law Center who focuses on energy and utility affordability, said that many deaths from extreme heat in the summer months are preventable. “The impression we’ve all had is that weather is most dangerous in the wintertime,” she said. “Not any more.” While the Trump administration fired the entire staff of the LIHEAP program in April, Wolfe and Lusson are hopeful Congress will approve slightly more funding for the program in the fall compared to the previous fiscal year, they said. To protect households during increasingly hotter summers, Lusson recommends individuals seek information about their rights when it comes to utility shutoffs. State utility commissions, which regulate public utilities, dictate local rules. To find your relevant commission, consult the government site operated by the national association of regulatory commissions, which has a state-by-state look-up tool. Lusson also encourages people to look into whether their state protections are calendar- or temperature-based, which can make a difference in planning. While some states forbid shut-offs during certain months of the year, others base the protections on the temperature of a given day or the presence of a heat advisory. This LIHEAP site has a break-down of every state’s policies. Some state attorney generals’ offices also have public utility bureaus that advocate on behalf of consumers, Lusson said. Lastly, it can be helpful to determine if your utility company offers discount rates or percentage-of-income payment plans to help with electricity bills. Both commission and utility websites have specific information about how to access LIHEAP assistance and whether or not the utility company itself offers assistance.",
    "image": "/images/south-park-season-27-premiere-launches-bold-satire-of-trump-and-paramount-settlement.webp",
    "slug": "low-income-families-face-heat-risks-power-shutoffs",
    "date": "Sept. 05, 2025",
    "author": "Benedict Johnson",
    "creator": "@benedictjo63174",
    "twitter": "https://x.com/benedictjo63174"
  },
  {
    "category": "business",
    "title": "China outlines more controls on exports of rare earths and technology",
    "shortdescription": "China has expanded export restrictions on rare earth elements and related technologies, requiring foreign firms to seek special approval for products containing even small amounts of these materials. The move, aimed at “safeguarding national security,” heightens trade tensions with the U.S. ahead of a planned meeting between Presidents Trump and Xi Jinping.",
    "description": "China outlined new curbs on exports of rare earths and related technologies on Thursday, extending controls over use of the elements critical for many products ahead of a meeting later this month between President Donald Trump and Chinese leader Xi Jinping. The regulations announced by the Ministry of Commerce require foreign companies to get special approval to export items that contain even small traces of rare earths elements sourced from China. Beijing also will impose permitting requirements on exports of technologies related to rare earths mining, smelting, recycling and magnet-making, it said. China accounts for nearly 70% of the world’s rare earths mining. It also controls roughly 90% of global rare earths processing. Access to such materials is a key point of contention in trade talks between Washington and Beijing. As Trump has raised tariffs on imports of many products from China, Beijing has doubled down on controls on the strategically vital minerals, raising concerns over potential shortages for manufacturers in the U.S. and elsewhere. It was not immediately clear how China plans to enforce the new policies overseas. The critical minerals are used in a broad range of products, from jet engines, radar systems and automotives to consumer electronics including laptops and phones. The new restrictions are to “better safeguard national security” and to stop uses in “sensitive fields such as the military” that stem from rare earths processed or sourced from China or from its related technologies, the Commerce Ministry said. It said some unnamed “overseas bodies and individuals” had transferred rare earths elements and technologies from China abroad for military or other sensitive uses which caused “significant damage” to its national security. The new curbs were announced just weeks ahead of an expected meeting between Trump and Chinese President Xi Jinping in late October on the sidelines of the Asia-Pacific Economic Cooperation forum in South Korea. “Rare earths will continue to be a key part of negotiations for Washington and Beijing,” George Chen, a partner at The Asia Group, said in an emailed comment. “Both sides want more stability but there will be still a lot of noises before the two leaders, President Trump and Xi, can make a final deal next year when they meet. Those noises are all negotiation tactics.” In April, Chinese authorities imposed export curbs on seven rare earth elements shortly after Trump unveiled his steep tariffs on many trading partners including China. While supplies remain uncertain, China approved some permits for rare earth exports in June and said it was speeding up its approval processes.",
    "image": "/images/china-rare-earth-export-curbs .webp",
    "slug": "china-tightens-rare-earth-export-controls-trump-meeting",
    "date": "Oct. 09, 2025",
    "author": "Benedict Johnson",
    "creator": "@benedictjo63174",
    "twitter": "https://x.com/benedictjo63174"
  },
  {
    "category": "business",
    "title": "US consumer confidence declines again as Americans fret over prices, job market",
    "shortdescription": "U.S. consumer confidence fell in September to its lowest level since April as worries over inflation and a cooling job market deepened. The Conference Board’s index dropped to 94.2, with short-term expectations signaling possible recession risks amid weak hiring, rising prices, and uncertainty around Trump’s tariff policies.",
    "description": "U.S. consumer confidence declined again in September as Americans’ pessimism over inflation and the weakening job market continued to grow. The Conference Board said Tuesday that its consumer confidence index fell by 3.6 points to 94.2 in September, down from August’s 97.8. That’s a bigger drop than analysts were expecting and the lowest reading since April, when President Donald Trump rolled out his sweeping tariff policy. A measure of Americans’ short-term expectations for their income, business conditions and the job market fell to 73.4, remaining well below 80, the marker that can signal a recession ahead. Consumers’ assessments of their current economic situation dipped by 7 points to 125.4. Write-in responses to the survey showed that references to prices and inflation rose this month, regaining its top position as consumers’ main concern about the economy. Mentions of tariffs declined this month but remain elevated, the Conference Board said. Government data released earlier this month showed that inflation rose in August as the price of gas, groceries and airfares jumped.Consumer prices increased 2.9% last month from a year earlier, the Labor Department said, up from 2.7% the previous month and the biggest jump since January. Excluding the volatile food and energy categories, core prices rose 3.1%, the same as in July. While unemployment and layoffs remain historically low, there has been noticeable deterioration in the labor market this year and mounting evidence that people are having difficulty finding jobs. Earlier this month, the government reported that U.S. nonfarm employers added a paltry 22,000 jobs in August, following July’s disappointing 79,000 job gains. Worse, revisions to the May and June figures shaved 258,000 jobs off previous estimates. The unemployment rate stands at 4.3%, the highest since October 2021. Also Tuesday, the Labor Department reported that U.S. job openings in August remained at 7.2 million, about the same as the previous month. In addition to the lingering effects of 11 interest rate hikes by the Federal Reserve’s inflation fighters in 2022 and 2023, economists say the recent hiring slump may also be a result of Trump’s policies, including his sweeping and ever-changing tariffs on imports, a crackdown on illegal immigration and purges of the federal workforce. Many companies are locked in a “no hire, no fire” position, fearful of expanding payrolls until the effects of Trump’s tariffs are more clear. More jobs data comes Friday when the government releases its September labor market data, with analysts forecasting 50,000 job gains. However, that report could be postponed if a budget impasse in Congress leads to a government shutdown Wednesday. The share of consumers expecting a recession over the next year rose modestly in September to the highest level since May. Survey respondents who said they intended to buy a new or used car in the near future fell, while the share of those saying they planned to purchase a home rose to a four-month high. Those saying they planned to buy big-ticket items like appliances were little changed from August with big variations across categories.",
    "image": "/images/us-consumer-confidence-inflation-jobs.webp",
    "slug": "us-consumer-confidence-drops-september-inflation-jobs",
    "date": "Sept. 30, 2025",
    "author": "Benedict Johnson",
    "creator": "@benedictjo63174",
    "twitter": "https://x.com/benedictjo63174"
  },
  {
    "category": "business",
    "title": "The number of Americans filing for jobless benefits last week hits 263,000, most in nearly 4 years",
    "shortdescription": "U.S. jobless claims surged to 263,000 last week — the highest in nearly four years — signaling a weakening labor market and likely prompting the Federal Reserve to cut interest rates soon. Despite elevated inflation, slowing job growth and major downward revisions to employment data point to rising economic strain under Trump’s trade and tariff policies.",
    "description": "In another grim sign for the U.S. labor market, jobless claim applications jumped to their highest level in almost four years last week, virtually assuring the Federal Reserve will cut its benchmark interest rate next week. The number of Americans filing for unemployment benefits for the week ending Sept. 6 rose by 27,000 to 263,000, the Labor Department reported Thursday. That’s the most applications since the week of Oct. 23, 2021 and well above the 231,000 new applications economists forecast. It’s also the biggest week-to-week increase in almost a year. Most analysts were already forecasting an interest rate cut after Fed Chair Jerome Powell signaled as much at a conference of central bankers three weeks ago. However, another report Thursday showing that consumer inflation remains elevated could complicate the Fed’s dual mandate of keeping prices in check while supporting a healthy labor market. Typically the Fed would cut its key rate when unemployment rose in an attempt to spur more spending and growth. But it would do the opposite and raise rates — or keep them unchanged — in the face of rising inflation.“The hot inflation print will not likely change the Fed’s plan to cut rates in September, but it’s possible the Fed will hold in October if inflation expectations no longer look well-contained,” said Jeffrey Roach, chief economist for LPL Financial. Fed officials recently have expressed greater concern about the deteriorating labor market than inflation, and while a rate cut could spur economic growth and boost the job market, economists fear it could push inflation even farther above the Fed’s target of 2%. Earlier this week, the Bureau of Labor Statistics issued a massive preliminary revision of U.S. job gains for the 12 months ending in March, further evidence that the labor market has not been as strong as previously thought.The BLS’s revised figures showed that U.S. employers added 911,000 fewer jobs than originally reported in the year ending in March 2025, with the biggest weakness coming from the leisure and hospitality sector, professional and business services and retail. The report showed that job gains were tapering long before President Donald Trump rolled out his far-reaching tariffs on U.S. trading partners in April. The department issues the revisions every year, intending to better account for new businesses and ones that had gone out of business. Final revisions will come out in February 2026. The updated figures came after the agency reported Friday that the economy generated just 22,000 jobs in August, well below the 80,000 economists were expecting. Also last week, the government said that U.S. employers advertised 7.2 million job openings at the end of July, fewer than economists had forecast and the first time since April of 2021 that there were more unemployed Americans than job postings. Last month’s July employment report, which showed job gains of just 73,000 and included huge downward revisions for June and May, sent financial markets spiraling and prompted Trump to fire the head of the agency that compiles the monthly data. The various labor market reports have bolstered fears that Trump’s erratic economic policies, including the unpredictable taxes on imports, have created so much uncertainty that businesses are reluctant to hire. Broader U.S. economic growth has weakened so far this year as many companies have pulled back on expansion projects amid the uncertainty surrounding the impacts of the tariffs. Growth slowed to about a 1.3% annual rate in the first half of the year, down from 2.5% in 2024. Thursday’s unemployment benefits report showed that the four-week average of claims, which evens out some of the week-to-week volatility, rose by 9,750 to 240,500. The total number of Americans collecting unemployment benefits for the previous week of Aug. 30 was unchanged at 1.94 million. Weekly applications for jobless benefits are considered a proxy for layoffs and have mostly settled in a historically low range between 200,000 and 250,000 since the U.S. began to emerge from the COVID-19 pandemic nearly four years ago.",
    "image": "/images/us-jobless-claims-rise-fed-rate-cut.webp",
    "slug": "us-jobless-claims-surge-fed-rate-cut-expected",
    "date": "Sept. 11, 2025",
    "author": "Benedict Johnson",
    "creator": "@benedictjo63174",
    "twitter": "https://x.com/benedictjo63174"
  }
]